MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_aes.c
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_hal_aes.c
  * @brief   AES HAL module driver.
  *          This file provides Cryptography AES/SAES peripheral services.
  *
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Includes ------------------------------------------------------------------ */
#include "stm32_hal.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */

#if defined(AES) || defined(SAES)

/** @addtogroup AES
  * @{
  */
/** @defgroup AES_Introduction AES Introduction
  * @{

  The AES hardware abstraction layer provides a set of APIs to configure and control the AES (and SAES)
  peripheral on STM32 microcontrollers.

  The AES coprocessor (AES/SAES) encrypts or decrypts data, using an algorithm and implementation fully compliant with
  the Advanced Encryption Standard (AES/SAES) defined in Federal Information Processing Standards (FIPS)
  publication 197.
  It incorporates protection against side-channel attacks (SCA), including differential power analysis (DPA),
  and is certified to SESIP and PSA security assurance level 3.

  The peripheral supports CTR, GCM, GMAC, CCM, ECB, and CBC chaining modes for key sizes of 128 or 256 bits, as well as
  special modes such as hardware secret key encryption/decryption (Wrapped-key mode) and key sharing with the
  faster CRYP peripheral (Shared-key mode).


  */
/**
  * @}
  */

/** @defgroup AES_How_To_Use AES How To Use
  * @{

# How to use the AES HAL module driver

## The AES main features:

This AES HAL driver is a generic driver that provides a set of APIs to configure the AES/SAES
peripheral to an Advanced Encryption Standard compliant algorithm to perform data encryption or decryption.

## The AES HAL driver can be used as follows:

### Initialization/De-initialization

- Declare a hal_aes_handle_t handle structure, for example: hal_aes_handle_t  haes

- Initialize the AES low-level resources:
  - Enable the AES/SAES peripheral clock:
    - Either at the application level by calling:
      - **HAL_RCC_AES_EnableClock()** API for AES instance
      - **HAL_RCC_SAES_EnableClock()** API for SAES instance
    - Or set the USE_HAL_AES_CLK_ENABLE_MODEL define to HAL_CLK_ENABLE_PERIPH_ONLY within the
      stm32c5xx_hal_conf.h file. In this case, the AES/SAES clock is enabled within
      the HAL_AES_Init() API.
  - NVIC configuration to use interrupt process APIs (HAL_AES_Encrypt_IT() and HAL_AES_Decrypt_IT()):
    - Configure the AES interrupt priority
    - Enable the NVIC AES IRQ Channel
  - DMA configuration to use DMA process APIs (HAL_AES_Encrypt_DMA() and HAL_AES_Decrypt_DMA()):
    - Declare a hal_dma_handle_t handle structure for the transfer input or transfer output channel
    - Enable the DMAx interface clock
    - Configure the DMA handle parameters
    - Configure the DMA Inx or Outx channel
    - Associate the initialized DMA handle with the haes DMA In or Out handle
    - Configure the priority and enable the NVIC for the transfer complete interrupt on the DMA In or Out channel

- Initialize the AES handle by calling the HAL_AES_Init() API, which performs these operations:
  - Associate the instance with the handle
  - Initialize the handle state to HAL_AES_STATE_INIT

- De-initialize the AES handle by calling the HAL_AES_DeInit() API, which performs these operations:
  - Disable the AES/SAES peripheral
  - Abort the DMA input and output transfers
  - De-initialize the current handle object
  - Reset the handle state to HAL_AES_STATE_RESET

### Configuration

- Configure the AES/SAES peripheral in three steps:
  - Step 1 (Chaining mode (algorithm) configuration according to the defined compilation algorithm flag):
    - By default, all compilation algorithm flags are defined. Undefine the unused ones to optimize code size and
      reduce footprint.
    - The AES compilation algorithm flags are:
       - USE_HAL_AES_ECB_CBC_ALGO flag: The AES/SAES peripheral can be configured with one of the
       following chaining modes:
           - Electronic Code Book algorithm (ECB) by using HAL_AES_ECB_SetConfig() API; no parameter is required
           - Cipher Block Chaining algorithm (CBC) by using HAL_AES_CBC_SetConfig() API and provide the
             initialization vector
       - USE_HAL_AES_CTR_ALGO flag: Configure the AES peripheral to Counter chaining mode (CTR) by using
         HAL_AES_CTR_SetConfig() API and provide the initialization vector
       - USE_HAL_AES_GCM_GMAC_ALGO flag: The AES peripheral is configured to Galois/counter chaining mode(GCM/GMAC) by
         using HAL_AES_GCM_GMAC_SetConfig() API and provide the header, its size, and the initialization vector
       - USE_HAL_AES_CCM_ALGO flag: The AES peripheral is configured to Counter with Cipher Block Chaining-Message(CCM)
         by using HAL_AES_CCM_SetConfig() API and provide the header, its size, and B0
  - Step2 (Key configuration according to one of the following use cases):
    - Use the application normal key:
        - Call HAL_AES_SetNormalKey() API and provide the key and its size
        - This API is available with AES/SAES peripheral
    - Use the SAES Hardware key:
        - Call HAL_AES_SetHWKey() API and set the SAES hardware key, its size, and the key mode:
            - Set the normal key mode to encrypt/decrypt application messages
            - Set the wrap key mode to wrap/unwrap the application key
            - Set the share key mode to share/unshare the application key
        - This API is only available with SAES peripheral
        - When the selected HW key is either the BHK or the DHUK_XOR_BHK, read it from TAMP backup registers before any
          encryption/decryption
    - Use the application key shared by SAES peripheral:
      This key mode lets the AES instance receive the key shared by SAES peripheral via secure hardware buses:
        - Call HAL_AES_SetSharedKey() API and set the key size
        - This API is only available with AES peripheral
    - Use the application wrapped key:
      This key mode lets the SAES instance secure an application key by encrypting it with the SAES hardware key
      (wrapper key). To use the key, decrypt it with the same wrapper key. This mode is ensured by applying the
      following sequence:
        - Call HAL_AES_SetHWKey() API and select the SAES hardware key, set its size (wrapper key), and
          set the key mode to wrapped mode
        - Call HAL_AES_WrapKey() API and provide the application key to encrypt with the configured wrapper key and an
          output key buffer to write the encrypted key
        - After the process ends, delete the original key to keep it secure
        - To use the original key, configure the same wrapper key by calling HAL_AES_SetHWKey() and unwrap the
          encrypted key by calling HAL_AES_UnwrapKey() API. After the process ends, the decrypted key cannot be read
          and is loaded automatically into the key registers for further encrypt/decrypt operations
        - This API is only available with SAES peripheral
      Provide the same key size for HAL_AES_SetHWKey() API and the key size provided for the
      HAL_AES_WrapKey() and HAL_AES_UnwrapKey() APIs
      When the selected wrapper key is either the BHK or the DHUK_XOR_BHK, read it from TAMP backup registers before
      calling both APIs HAL_AES_WrapKey() and HAL_AES_UnwrapKey()
  - Step3 (Configure the data swapping):
     - By default, the AES is configured to no swap. If swapped data is provided, configure the swap mode
       by using the HAL_AES_SetDataSwapping() API

