MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_aes.c
### Callback registration

When the USE_HAL_AES_REGISTER_CALLBACKS compilation flag is set to 1, configure the driver callbacks dynamically:
 - HAL_AES_RegisterInTransferCpltCallback(): callback for end of transfer of data
 - HAL_AES_RegisterOutTransferCpltCallback(): callback for end of transfer of data
 - HAL_AES_RegisterErrorCallback(): callback for error.
 - HAL_AES_RegisterSuspendCallback(): callback for suspend.
When the compilation flag is set to 0 or not defined, the callback registration feature is not available, and all
callbacks are set to the corresponding weak functions.
  */
/**
  * @}
  */

/** @defgroup AES_Configuration_Table AES Configuration Table
  * @{
## Configuration inside the AES driver

Config defines                 | Description     | Default value     | Note
------------------------------ | --------------- | ----------------- | ----------------------------------------
PRODUCT                        | from IDE        | None              | Ex:STM32C5xx
USE_HAL_AES_MODULE             | from hal_conf.h | 1                 | Enable the HAL AES module
USE_HAL_AES_CLK_ENABLE_MODEL   | from hal_conf.h | HAL_CLK_ENABLE_NO | Enable the HAL_AES_CLK
USE_ASSERT_DBG_PARAM           | from IDE        | None              | Enable the parameters asserts
USE_ASSERT_DBG_STATE           | from IDE        | None              | Enable the state asserts
USE_HAL_CHECK_PARAM            | from hal_conf.h | 0                 | Parameters runtime check
USE_HAL_SECURE_CHECK_PARAM     | from hal_conf.h | 0                 | Parameters runtime check for sensitive APIs
USE_HAL_CHECK_PROCESS_STATE    | from hal_conf.h | 0                 | Allows to use the load and store exclusive.
USE_HAL_AES_DMA                | from hal_conf.h | 1                 | Allows to use DMA mode
USE_HAL_AES_ECB_CBC_ALGO       | from hal_conf.h | 1                 | Allows to use ECB and CBC algorithms
USE_HAL_AES_CTR_ALGO           | from hal_conf.h | 1                 | Allows to use CTR algorithm
USE_HAL_AES_GCM_GMAC_ALGO      | from hal_conf.h | 1                 | Allows to use GCM and GMAC algorithms
USE_HAL_AES_CCM_ALGO           | from hal_conf.h | 1                 | Allows to use CCM algorithm
USE_HAL_AES_SUSPEND_RESUME     | from hal_conf.h | 1                 | Allows to use Suspend features
USE_HAL_AES_REGISTER_CALLBACKS | from hal_conf h | 0                 | Allows to use register callbacks
USE_HAL_AES_GET_LAST_ERRORS    | from hal_conf.h | 0                 | Allows to use error code mechanism
USE_HAL_AES_USER_DATA          | from hal_conf.h | 0                 | Allows to use user data
  */
/**
  * @}
  */
#if defined(USE_HAL_AES_MODULE) && (USE_HAL_AES_MODULE == 1U)
#if (defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)) \
    || (defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1)) \
    || (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1))\
    || (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))

/* Private constants ------------------------------------------------------------------------------------------------*/
/** @defgroup AES_Private_Constants AES Private Constants
  * @{
  */
#define AES_BLOCK_SIZE_BYTES       16U   /* AES block size in bytes */
#define AES_BLOCK_WORDS            4U    /* AES block size in words */

/*! AES Algorithm Modes */
#define AES_ALGORITHM_ECB      0x00000000U                       /*!< Electronic codebook chaining algorithm */
#define AES_ALGORITHM_CBC      AES_CR_CHMOD_0                    /*!< Cipher block chaining algorithm */
#define AES_ALGORITHM_CTR      AES_CR_CHMOD_1                    /*!< Counter mode chaining algorithm */
#define AES_ALGORITHM_GCM_GMAC (AES_CR_CHMOD_0 | AES_CR_CHMOD_1) /*!< Galois counter mode - Galois message
                                                                      authentication code */
#define AES_ALGORITHM_CCM      AES_CR_CHMOD_2                    /*!< Counter with Cipher Mode */

#if defined(USE_HAL_AES_SUSPEND_RESUME) && (USE_HAL_AES_SUSPEND_RESUME == 1)
/*! AES suspend request enumeration definition */
#define AES_SUSPEND_NONE 0x00U /*!< AES processing suspension is not requested */
#define AES_SUSPEND      0x01U /*!< AES processing suspension is requested */
#endif /* USE_HAL_AES_SUSPEND_RESUME */

/*! AES Operating Modes */
#define AES_OPERATING_MODE_ENCRYPT       0x00000000U   /*!< Encryption mode */
#if defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)
#define AES_OPERATING_MODE_KEYDERIVATION AES_CR_MODE_0 /*!< Key derivation mode only used when performing ECB and CBC
                                                            decryptions */
#endif /* USE_HAL_AES_ECB_CBC_ALGO */
#define AES_OPERATING_MODE_DECRYPT       AES_CR_MODE_1 /*!< Decryption mode */

#if (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1))\
|| (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))
/*! AES GCM GMAC CCM Phases */
#define AES_PHASE_INIT              0x00000000U    /*!< GCM/GMAC (or CCM) init phase */
#define AES_PHASE_HEADER            AES_CR_CPHASE_0 /*!< GCM/GMAC or CCM header phase */
#define AES_PHASE_PAYLOAD           AES_CR_CPHASE_1 /*!< GCM(/CCM) payload phase      */
#define AES_PHASE_FINAL             AES_CR_CPHASE   /*!< GCM/GMAC or CCM final phase */
#endif /* USE_HAL_AES_GCM_GMAC_ALGO || USE_HAL_AES_CCM_ALGO */

/*! AES Timeout Values */
#define AES_GENERAL_TIMEOUT_MS      82U  /*!< General AES operation timeout in milliseconds */
#if (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1))\
|| (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))
#define AES_INIT_PHASE_LATENCY      88U  /*!< The latency of GCM/CCM init phase to prepare hash subkey */
#define AES_HEADER_PHASE_LATENCY    240U /*!< The latency of GCM/CCM header phase is 240 clock cycles */
#define AES_PAYLOAD_PHASE_LATENCY   486U /*!< The latency of GCM/CCM header phase is 486 clock cycles */
#endif /* USE_HAL_AES_GCM_GMAC_ALGO || USE_HAL_AES_CCM_ALGO */
#if defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)
#define AES_KEY_DERIVATION_LATENCY  82U  /*!< The latency of key preparation operation is 82 clock cycles */
#endif /* USE_HAL_AES_ECB_CBC_ALGO */
#if defined(SAES)
#define SAES_KEY_DERIVATION_LATENCY 324U /*!< The latency of key preparation operation is 324 clock cycles */
#if defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1)
#define AES_CTR_UNWRAP_LATENCY      100U /*!< The latency of CTR unwrap is 100 clock cycles */
#endif /* USE_HAL_AES_CTR_ALGO */
#endif /* SAES */
#if defined (USE_HAL_AES_RNG_RECOVERY) && (USE_HAL_AES_RNG_RECOVERY == 1U)
#if defined(RNG_HTSR0_RPERRX) || defined(RNG_HTSR1_ADERRX)
#define AES_RNG_TIMEOUT_VALUE       0x00000002U
#endif /* RNG_HTSR0_RPERRX || RNG_HTSR1_ADERRX */
#endif /* USE_HAL_AES_RNG_RECOVERY */
/**
  * @}
  */

/* Private macro -------------------------------------------------------------*/
/** @defgroup AES_Private_Macros AES Private Macros
  * @{
  */
/*! Macro to get the handle instance */
#define AES_GET_INSTANCE(handle) ((AES_TypeDef *)((uint32_t)(handle)->instance))

/*! Macro to check the key size */
#define IS_AES_KEY_SIZE(key_size) (((key_size) == HAL_AES_KEY_SIZE_128BIT) || ((key_size) == HAL_AES_KEY_SIZE_256BIT))
#if defined(SAES)

/*! Macro to check the key size alignment between the wrapper key and the user key */
#define IS_AES_HW_KEY_SIZE(handle,key_size) ((uint32_t)key_size == \
                                             ((AES_GET_INSTANCE(handle)->CR) & (AES_CR_KEYSIZE)))
/*! Macro to check the key select */
#define IS_AES_KEY_SELECT(key_select) (((key_select) == HAL_AES_KEY_SELECT_DHUK) \
                                       || ((key_select) == HAL_AES_KEY_SELECT_BHK) \
                                       || ((key_select) == HAL_AES_KEY_SELECT_DHUK_XOR_BHK))

/*! Macro to check the key mode */
#define IS_AES_KEY_MODE(key_mode) (((key_mode) == HAL_AES_KEY_MODE_NORMAL) || ((key_mode) == HAL_AES_KEY_MODE_WRAPPED) \
                                   || ((key_mode) == HAL_AES_KEY_MODE_SHARED))
/*! Macro to check the key to be unwrapped */
#if (defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1))\
     || (defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1))
#define IS_AES_KEY_IN(p_key_in, algorithm) \
  (((algorithm) == AES_ALGORITHM_CTR) ? \
   ((p_key_in) == 0U) : \
   (((algorithm) == AES_ALGORITHM_ECB) || ((algorithm) == AES_ALGORITHM_CBC)))
#endif /* USE_HAL_AES_ECB_CBC_ALGO or USE_HAL_AES_CTR_ALGO */
#endif /* SAES */

#define IS_AES_SUSPEND_RESUME(instance, algorithm) \
  (((algorithm) == AES_ALGORITHM_ECB) \
   || ((algorithm) == AES_ALGORITHM_CBC) \
   || ((algorithm) == AES_ALGORITHM_CTR) \
   || ((algorithm) == AES_ALGORITHM_CCM) \
   || (((instance) == HAL_AES) && ((algorithm) == AES_ALGORITHM_GCM_GMAC)))

/*! Macro to check the data swapping */
#define IS_AES_DATA_SWAPPING(data_swapping) (((data_swapping) == HAL_AES_DATA_SWAPPING_NO) \
                                             || ((data_swapping) == HAL_AES_DATA_SWAPPING_HALFWORD) \
                                             || ((data_swapping) == HAL_AES_DATA_SWAPPING_BYTE) \
                                             || ((data_swapping) == HAL_AES_DATA_SWAPPING_BIT))

/*! Macro to enable the AES/SAES peripheral */
#define AES_ENABLE(handle) (AES_GET_INSTANCE(handle)->CR |=  AES_CR_EN)

/*! Macro to disable the AES/SAES peripheral */
#define AES_DISABLE(handle) (AES_GET_INSTANCE(handle)->CR &=  ~AES_CR_EN)
/**
  * @}
  */

/** @defgroup AES_Private_Functions AES Private Functions
  * @{
  */
static void AES_SetNormalKey(hal_aes_handle_t *haes, hal_aes_key_size_t key_size, const uint32_t *p_key);
static hal_status_t AES_WaitForSetKey(hal_aes_handle_t *haes);
static void AES_SetIV(hal_aes_handle_t *haes, const uint32_t *p_init_vect);
static hal_status_t AES_ProcessOneblock(hal_aes_handle_t *haes, uint32_t timeout_ms);
static hal_status_t AES_WaitOnCCFlag(hal_aes_handle_t *haes, uint32_t timeout_ms);
#if defined(SAES_BASE)
#if (defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)) \
    || (defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1)) \
    || (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)) \
    || (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))
static hal_status_t AES_WaitOnCCFlag_NonBlocking(hal_aes_handle_t *haes, uint32_t latency_clock_cycle);
#endif /* USE_HAL_AES_ECB_CBC_ALGO or USE_HAL_AES_CTR_ALGO or USE_HAL_AES_GCM_GMAC_ALGO or USE_HAL_AES_CCM_ALGO */
#else
#if (defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)) \
    || (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)) \
    || (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))
static hal_status_t AES_WaitOnCCFlag_NonBlocking(hal_aes_handle_t *haes, uint32_t latency_clock_cycle);
#endif /* USE_HAL_AES_ECB_CBC_ALGO or USE_HAL_AES_GCM_GMAC_ALGO or USE_HAL_AES_CCM_ALGO */
#endif /* SAES_BASE */
#if defined(USE_HAL_AES_DMA) && (USE_HAL_AES_DMA == 1)
static void AES_DMAError(hal_dma_handle_t *hdma);
#endif /* USE_HAL_AES_DMA */

#if defined(SAES)
static hal_status_t AES_RNGFetchGetStatus(hal_aes_handle_t *haes);
#endif /* SAES */
#if defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)
static hal_status_t AES_KeyDerivation(hal_aes_handle_t *haes);
#endif /* USE_HAL_AES_ECB_CBC_ALGO */

