MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_aes.c
  haes->data_size_sum_byte = 0U;
  haes->algorithm = AES_ALGORITHM_CBC;

  haes->global_state = HAL_AES_STATE_IDLE;
  return HAL_OK;
}
#endif /* USE_HAL_AES_ECB_CBC_ALGO */

#if defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1)
/**
  * @brief  Configure the AES/SAES peripheral with the CTR algorithm.
  * @param  haes              Pointer to a @ref hal_aes_handle_t structure
  * @param  p_init_vect       Pointer to **const uint32_t** four words buffer provided by the user. For CTR algorithm,
  *                           the init vector is used to process each data block
  * @retval HAL_INVALID_PARAM Invalid param return when the provided init vector pointer is null or the handle pointer
  *                           is null
  * @retval HAL_ERROR         Error detected while fetching a random number from RNG peripheral (only for SAES instance)
  * @retval HAL_OK            AES/SAES peripheral has been correctly configured with the CTR algorithm
  */
hal_status_t HAL_AES_CTR_SetConfig(hal_aes_handle_t *haes, const uint32_t *p_init_vect)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(p_init_vect != NULL);
  ASSERT_DBG_STATE(haes->global_state, (uint32_t)HAL_AES_STATE_INIT | (uint32_t)HAL_AES_STATE_IDLE);

#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if (p_init_vect == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (haes == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

#if defined(SAES)
  /* Fetch random numbers from RNG after enabling RNG and SAES clocks, SAES supports only ECB and CBC algorithms */
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  if (((uint32_t)(haes->instance) == (uint32_t)SAES_S) || ((uint32_t)(haes->instance) == (uint32_t)SAES_NS))
#else
  if (haes->instance == HAL_SAES)
#endif /* USE_HAL_SECURE_CHECK_PARAM */
  {
#if defined (USE_HAL_AES_RNG_RECOVERY) && (USE_HAL_AES_RNG_RECOVERY == 1U)
#if defined(RNG_HTSR0_RPERRX) || defined(RNG_HTSR1_ADERRX)
    /*Check if there is an RNG seed error */
    if (LL_RNG_IsActiveFlag_SECS(RNG) != 0U)
    {
      /* Attempt to recover from the seed error */
      if (AES_RNG_ResilientRecoverSeedError() != HAL_OK)
      {
        return HAL_ERROR;
      }

#if defined (AES_ICR_RNGEIF)
      /* Clear Rng error interrupt flag */
      STM32_SET_BIT(AES_GET_INSTANCE(haes)->ICR, AES_ICR_RNGEIF);
#endif /* AES_ICR_RNGEIF */
    }
#endif /* RNG_HTSR0_RPERRX || RNG_HTSR1_ADERRX */
#endif /* USE_HAL_AES_RNG_RECOVERY */
    if (AES_RNGFetchGetStatus(haes) != HAL_OK)
    {
      return HAL_ERROR;
    }
  }
#endif /* SAES */

  AES_DISABLE(haes);

#if defined(SAES)
  if (haes->instance == HAL_AES)
  {
#endif /* SAES */
    STM32_MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_CHMOD | AES_CR_DATATYPE, AES_ALGORITHM_CTR);
#if defined(SAES)
  }
  else
  {
    STM32_MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_CHMOD | AES_CR_KEYSEL | AES_CR_DATATYPE, AES_ALGORITHM_CTR);
  }
#endif /* SAES */
  AES_SetIV(haes, p_init_vect);

  haes->data_size_sum_byte = 0U;
  haes->algorithm = AES_ALGORITHM_CTR;

  haes->global_state = HAL_AES_STATE_IDLE;
  return HAL_OK;
}
#endif /* USE_HAL_AES_CTR_ALGO */

#if defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)
/**
  * @brief  Configure the AES/SAES peripheral with the GCM_GMAC algorithm.
  * @param  haes              Pointer to a @ref hal_aes_handle_t structure
  * @param  p_config          Pointer to a @ref hal_aes_gcm_config_t structure that contains the AES configuration with
  *                           GCM_GMAC algorithms
  * @retval HAL_INVALID_PARAM  Invalid param return when:
  *                           - The configuration structure pointer is null
  *                           - The provided init vector pointer within the configuration structure is null
  *                           - The provided header within the configuration structure is null but its size is not null
  *                           - The handle pointer is null
  * @retval HAL_ERROR         Error detected while fetching a random number from RNG peripheral (only for SAES instance)
  * @retval HAL_OK            AES/SAES peripheral has been correctly configured with the GCM_GMAC algorithm
  */
hal_status_t HAL_AES_GCM_GMAC_SetConfig(hal_aes_handle_t *haes, const hal_aes_gcm_config_t *p_config)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(p_config->p_init_vect != NULL);
  ASSERT_DBG_STATE(haes->global_state, (uint32_t)HAL_AES_STATE_INIT | (uint32_t)HAL_AES_STATE_IDLE);

#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if ((p_config == NULL) || (p_config->p_init_vect == NULL) || ((p_config->p_header == NULL)
                                                                && (p_config->header_size_byte != 0U)))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (haes == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

#if defined(SAES)
  /* Fetch random numbers from RNG after enabling RNG and SAES clocks, SAES supports only ECB and CBC algorithms */
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  if (((uint32_t)(haes->instance) == (uint32_t)SAES_S) || ((uint32_t)(haes->instance) == (uint32_t)SAES_NS))
#else
  if (haes->instance == HAL_SAES)
#endif /* USE_HAL_SECURE_CHECK_PARAM */
  {
#if defined (USE_HAL_AES_RNG_RECOVERY) && (USE_HAL_AES_RNG_RECOVERY == 1U)
#if defined(RNG_HTSR0_RPERRX) || defined(RNG_HTSR1_ADERRX)
    /*Check if there is an RNG seed error */
    if (LL_RNG_IsActiveFlag_SECS(RNG) != 0U)
    {
      /* Attempt to recover from the seed error */
      if (AES_RNG_ResilientRecoverSeedError() != HAL_OK)
      {
        return HAL_ERROR;
      }

#if defined (AES_ICR_RNGEIF)
      /* Clear Rng error interrupt flag */
      STM32_SET_BIT(AES_GET_INSTANCE(haes)->ICR, AES_ICR_RNGEIF);
#endif /* AES_ICR_RNGEIF */
    }
#endif /* RNG_HTSR0_RPERRX || RNG_HTSR1_ADERRX */
#endif /* USE_HAL_AES_RNG_RECOVERY */
    if (AES_RNGFetchGetStatus(haes) != HAL_OK)
    {
      return HAL_ERROR;
    }
  }
#endif /* SAES */
  AES_DISABLE(haes);
#if defined(SAES)
  if (haes->instance == HAL_AES)
  {
#endif /* SAES */
    STM32_MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_CHMOD | AES_CR_DATATYPE | AES_CR_CPHASE | AES_CR_NPBLB,
                     AES_ALGORITHM_GCM_GMAC);
#if defined(SAES)
  }
  else
  {
    STM32_MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_CHMOD | AES_CR_KEYSEL | AES_CR_DATATYPE | AES_CR_CPHASE
                     | AES_CR_NPBLB, AES_ALGORITHM_GCM_GMAC);
  }
#endif /* SAES */

