MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_aes.c
  AES_SetIV(haes, p_config->p_init_vect);

  haes->p_header = p_config->p_header;
  haes->header_size_byte = p_config->header_size_byte;
  haes->data_size_sum_byte = 0U;
  haes->algorithm = AES_ALGORITHM_GCM_GMAC;

  haes->global_state = HAL_AES_STATE_IDLE;
  return HAL_OK;
}
#endif /* USE_HAL_AES_GCM_GMAC_ALGO */

#if defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1)
/**
  * @brief  Configure the AES/SAES peripheral with the CCM algorithm.
  * @param  haes              Pointer to a @ref hal_aes_handle_t structure
  * @param  p_config          Pointer to a @ref hal_aes_ccm_config_t structure
  * @retval HAL_INVALID_PARAM Invalid param return when:
  *                           - The configuration structure pointer is null
  *                           - The provided b0 within the configuration structure is null
  *                           - The provided header within the configuration structure is null but its size is not null
  *                           - The handle pointer is null
  * @retval HAL_ERROR         Error detected while fetching a random number from RNG peripheral (only for SAES instance)
  * @retval HAL_OK            AES/SAES peripheral has been correctly configured with the CCM algorithm
  */
hal_status_t HAL_AES_CCM_SetConfig(hal_aes_handle_t *haes, const hal_aes_ccm_config_t *p_config)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(p_config->p_b0 != NULL);
  ASSERT_DBG_STATE(haes->global_state, (uint32_t)HAL_AES_STATE_INIT | (uint32_t)HAL_AES_STATE_IDLE);

#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if ((p_config == NULL) || (p_config->p_b0 == NULL) || ((p_config->p_header == NULL)
                                                         && (p_config->header_size_byte != 0U)))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (haes == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

#if defined(SAES)
  /* Fetch random numbers from RNG after enabling RNG and SAES clocks, SAES supports only ECB and CBC algorithms */
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  if (((uint32_t)(haes->instance) == (uint32_t)SAES_S) || ((uint32_t)(haes->instance) == (uint32_t)SAES_NS))
#else
  if (haes->instance == HAL_SAES)
#endif /* USE_HAL_SECURE_CHECK_PARAM */
  {
#if defined (USE_HAL_AES_RNG_RECOVERY) && (USE_HAL_AES_RNG_RECOVERY == 1U)
#if defined(RNG_HTSR0_RPERRX) || defined(RNG_HTSR1_ADERRX)
    /*Check if there is an RNG seed error */
    if (LL_RNG_IsActiveFlag_SECS(RNG) != 0U)
    {
      /* Attempt to recover from the seed error */
      if (AES_RNG_ResilientRecoverSeedError() != HAL_OK)
      {
        return HAL_ERROR;
      }

#if defined (AES_ICR_RNGEIF)
      /* Clear Rng error interrupt flag */
      STM32_SET_BIT(AES_GET_INSTANCE(haes)->ICR, AES_ICR_RNGEIF);
#endif /* AES_ICR_RNGEIF */
    }
#endif /* RNG_HTSR0_RPERRX || RNG_HTSR1_ADERRX */
#endif /* USE_HAL_AES_RNG_RECOVERY */
    if (AES_RNGFetchGetStatus(haes) != HAL_OK)
    {
      return HAL_ERROR;
    }
  }
#endif /* SAES */

  AES_DISABLE(haes);

#if defined(SAES)
  if (haes->instance == HAL_AES)
  {
#endif /* SAES */
    STM32_MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_CHMOD | AES_CR_DATATYPE | AES_CR_CPHASE | AES_CR_NPBLB,
                     AES_ALGORITHM_CCM);
#if defined(SAES)
  }
  else
  {
    STM32_MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_CHMOD | AES_CR_KEYSEL | AES_CR_DATATYPE | AES_CR_CPHASE
                     | AES_CR_NPBLB, AES_ALGORITHM_CCM);
  }
#endif /* SAES */
  AES_SetIV(haes, p_config->p_b0);

  haes->p_header = p_config->p_header;
  haes->header_size_byte = p_config->header_size_byte;
  haes->data_size_sum_byte = 0U;
  haes->algorithm = AES_ALGORITHM_CCM;

  haes->global_state = HAL_AES_STATE_IDLE;
  return HAL_OK;
}
#endif /* USE_HAL_AES_CCM_ALGO */

/**
  * @brief  Configure the AES Normal key(key size, key value), supports both AES and SAES instances.
  * @param  haes              Pointer to a @ref hal_aes_handle_t structure
  * @param  key_size          AES key size with a **hal_aes_key_size_t** type
  * @param  p_key             A **uint32_t** AES key that must be coherent with the **key_size**
  * @retval HAL_INVALID_PARAM Invalid param return when the provided pointer key is null or the handle
  *                           pointer is null
  * @retval HAL_ERROR         Error when loading the key into registers exceeds the dedicated timeout
  * @retval HAL_OK            Normal key has been configured
  */
hal_status_t HAL_AES_SetNormalKey(hal_aes_handle_t *haes, hal_aes_key_size_t key_size, const uint32_t *p_key)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(p_key != NULL);
  ASSERT_DBG_PARAM(IS_AES_KEY_SIZE(key_size));
  ASSERT_DBG_STATE(haes->global_state, HAL_AES_STATE_IDLE);

#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if (p_key == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (haes == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  HAL_AES_ClearFlagKERR(haes);

#if defined(SAES)
  if (haes->instance == HAL_AES)
  {
#endif /* SAES */
    STM32_MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_KEYSIZE, (uint32_t)key_size);
#if defined(SAES)
  }
  else
  {
    STM32_MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_KEYSIZE | AES_CR_KEYSEL, (uint32_t)key_size);
  }
#endif /* SAES */

  AES_SetNormalKey(haes, key_size, p_key);

  if (AES_WaitForSetKey(haes) != HAL_OK)
  {
    return HAL_ERROR;
  }

#if defined(USE_HAL_AES_SUSPEND_RESUME) && (USE_HAL_AES_SUSPEND_RESUME == 1)
  haes->p_key = p_key;
#endif /* USE_HAL_AES_SUSPEND_RESUME */

  return HAL_OK;
}

#if defined(SAES)
/**
  * @brief  Configure the AES shared key mode to acquire the key shared by the SAES peripheral.
  * @param  haes              Pointer to a @ref hal_aes_handle_t structure
  * @param  key_size          AES key size with a **hal_aes_key_size_t** type
  * @warning The configured size must be the same as the size of the shared key
  * @retval  HAL_INVALID_PARAM Invalid param return when the handle instance is other than AES or the handle
  *                            pointer is null
  * @retval  HAL_ERROR         Error when loading the key into registers exceeds the dedicated timeout
  * @retval  HAL_OK            Normal key has been configured
  */
hal_status_t HAL_AES_SetSharedKey(hal_aes_handle_t *haes, hal_aes_key_size_t key_size)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(IS_AES_ALL_INSTANCE(AES_GET_INSTANCE(haes)));
  ASSERT_DBG_PARAM(IS_AES_KEY_SIZE(key_size));
  ASSERT_DBG_STATE(haes->global_state, HAL_AES_STATE_IDLE);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (haes == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

