MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_aes.c
#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if (haes->instance != HAL_AES)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

  HAL_AES_ClearFlagKERR(haes);

  STM32_MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_KMOD | AES_CR_KEYSIZE,
                   (uint32_t)AES_CR_KMOD_1 | (uint32_t)key_size);

  if (HAL_AES_GetFlag(haes, HAL_AES_FLAG_KERR) == 0U)
  {
    if (AES_WaitForSetKey(haes) != HAL_OK)
    {
      return HAL_ERROR;
    }
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Configure the SAES Hardware key.
  * @param  haes              Pointer to a @ref hal_aes_handle_t structure
  * @param  key_size          AES key size with a **hal_aes_key_size_t** type
  * @param  key_select        key selection with a **hal_aes_key_select_t** type
  * @param  key_mode          key mode with a **hal_aes_key_mode_t** type
  * @retval HAL_INVALID_PARAM Invalid param return when the handle instance is other than SAES or the handle pointer
  *                           is null
  * @retval HAL_ERROR         Error when loading the key into registers exceeds the dedicated timeout
  * @retval HAL_OK            Hardware key has been configured
  */
hal_status_t HAL_AES_SetHWKey(hal_aes_handle_t *haes, hal_aes_key_size_t key_size, hal_aes_key_select_t key_select,
                              hal_aes_key_mode_t key_mode)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(IS_SAES_ALL_INSTANCE(AES_GET_INSTANCE(haes)));
  ASSERT_DBG_PARAM(IS_AES_KEY_SIZE(key_size));
  ASSERT_DBG_PARAM(IS_AES_KEY_SELECT(key_select));
  ASSERT_DBG_PARAM(IS_AES_KEY_MODE(key_mode));
  ASSERT_DBG_STATE(haes->global_state, HAL_AES_STATE_IDLE);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (haes == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if (haes->instance != HAL_SAES)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

  HAL_AES_ClearFlagKERR(haes);

  STM32_MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_KEYSEL | AES_CR_KEYSIZE | AES_CR_KMOD,
                   (uint32_t)key_select | (uint32_t)key_size | (uint32_t)key_mode);

  if (AES_WaitForSetKey(haes) != HAL_OK)
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

#endif /* SAES */

/**
  * @brief  Configure the AES data swapping.
  * @param  haes          Pointer to a @ref hal_aes_handle_t structure
  * @param  data_swapping AES data swapping with a **hal_aes_data_swapping_t** type
  * @retval HAL_OK        The AES data swapping mode is set
  */
hal_status_t HAL_AES_SetDataSwapping(hal_aes_handle_t *haes, hal_aes_data_swapping_t data_swapping)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(IS_AES_DATA_SWAPPING(data_swapping));
  ASSERT_DBG_STATE(haes->global_state, HAL_AES_STATE_IDLE);

  STM32_MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_DATATYPE, (uint32_t)data_swapping);

  return HAL_OK;
}

/**
  * @brief  Retrieve the AES configured data swapping.
  * @param  haes                  Pointer to a @ref hal_aes_handle_t structure
  * @retval HAL_AES_NO_SWAP       The bit order of the input and output data is not affected
  * @retval HAL_AES_HALFWORD_SWAP The bit-reversal is done by halfword Ex: 0011 1100 0100 1101 --> 0100 1101 0011 1100
  * @retval HAL_AES_BYTE_SWAP     The bit-reversal is done by byte Ex: 0011 1100 0100 1101 --> 1101 0100 1100 0011
  * @retval HAL_AES_BIT_SWAP      The bit-reversal is done by bit Ex: 0011 1100 0100 1101 --> 1011 0010 0011 1100
  */
hal_aes_data_swapping_t HAL_AES_GetDataSwapping(const hal_aes_handle_t *haes)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_STATE(haes->global_state, HAL_AES_STATE_IDLE);

  return ((hal_aes_data_swapping_t)(uint32_t)STM32_READ_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_DATATYPE));
}
/**
  * @}
  */

/** @addtogroup AES_Exported_Functions_Group3
  * @{
 This subsection provides a set of functions allowing to perform AES processing and manage suspension/resumption:
  - HAL_AES_Encrypt():Allowing to encrypt a plaintext within a dedicated timeout
  - HAL_AES_Decrypt():Allowing to decrypt a ciphertext within a dedicated timeout
  - HAL_AES_Encrypt_IT():Allowing to encrypt a plaintext using the AES interrupt
  - HAL_AES_Decrypt_IT():Allowing to decrypt a ciphertext using the AES interrupt
  - HAL_AES_Encrypt_DMA():Allowing to encrypt a plaintext using the DMA
  - HAL_AES_Decrypt_DMA():Allowing to decrypt a ciphertext using the DMA
  - HAL_AES_RequestSuspend():Allowing to request an IT process suspension
  - HAL_AES_SaveContext():Allowing to save the context of the suspended process to start another high priority one
  - HAL_AES_RestoreContext():Allowing to restore the saved context of the low prior process
  - HAL_AES_Resume():Allowing to resume the low prior process
  */
/**
  * @brief  Encrypt user data in polling mode.
  *       - For ECB, CBC or CTR algorithms:
  *                           - The padding is not supported.
  *                           - Only the encryption of the plaintext is available (no preparation for tag generation).
  *       - For GCM algorithm:- HAL_AES_Encrypt() is used either to:
  *                           - Encrypt a plaintext and use the header to prepare for the tag generation.
  *                           - Or just do the encryption (header null).
  *                           - Or just prepare for tag generation (plaintext null).
  *       - For GMAC algorithm: Prepare for the tag generation only (plaintext null).
  *       - For CCM algorithm:- HAL_AES_Encrypt() is used either to:
  *                           - Encrypt a plaintext and use the header to prepare for the tag generation.
  *                           - Or just do the encryption (header null).
  *                           - Or just prepare for tag generation (plaintext null)(not recommended by NIST).
  * @param   haes              Pointer to a @ref hal_aes_handle_t structure
  * @param   p_input           Pointer to aligned **const void** plaintext
  * @param   size_byte         Length of the plaintext buffer that must be in byte
  * @param   p_output          Pointer to aligned **void** data buffer to be filled with the encrypted text
  * @param   timeout_ms        Specify timeout value in milliseconds
  * @warning No swapped user data must be provided in big-endian. When data are provided in little-endian, the user must
  *          configure the swapping mode before starting the process (ex when data are provided as little-endian bytes,
  *          the swap mode must be set to HAL_AES_BYTE_SWAP or when data are provided as little-endian halfwords, the
  *          swap mode must be set to HAL_AES_HALFWORD_SWAP)
  * @retval  HAL_INVALID_PARAM For ECB, CBC or CTR algorithms Invalid param return when:
  *                             - The provided input data buffer pointer is null
  *                             - Or the output data buffer pointer is null
  *                             - Or the input buffer is empty
  *                            For GCM_GMAC or CCM algorithms Invalid param return when:
  *                             - The provided input data buffer pointer is null but its size is # 0U
  *                            The handle pointer is null
  *                            The provided timeout is null
  * @retval  HAL_BUSY          Another AES process is ongoing
  * @retval  HAL_ERROR         Error return when the loaded key is invalid
  * @retval  HAL_TIMEOUT       AES encryption exceeds user timeout
  * @retval  HAL_OK            AES encryption is successfully accomplished
  */
hal_status_t HAL_AES_Encrypt(hal_aes_handle_t *haes, const void *p_input, uint16_t size_byte, void *p_output,
                             uint32_t timeout_ms)
{
#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((haes == NULL) || (timeout_ms == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  ASSERT_DBG_PARAM(haes != NULL);
#if (defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)) \
     || (defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1))
  if ((haes->algorithm == AES_ALGORITHM_ECB) || (haes->algorithm == AES_ALGORITHM_CBC)
      || (haes->algorithm == AES_ALGORITHM_CTR))
  {
    ASSERT_DBG_PARAM(p_input != NULL);
    ASSERT_DBG_PARAM(p_output != NULL);
    ASSERT_DBG_PARAM(size_byte != 0U);
  }
#endif /* USE_HAL_AES_ECB_CBC_ALGO OR USE_HAL_AES_CTR_ALGO */
  ASSERT_DBG_STATE(haes->global_state, HAL_AES_STATE_IDLE);

