MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_aes.c
#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
#if (defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)) \
     || (defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1))
  if ((haes->algorithm == AES_ALGORITHM_ECB) || (haes->algorithm == AES_ALGORITHM_CBC)
      || (haes->algorithm == AES_ALGORITHM_CTR))
  {
    if ((p_input == NULL) || (p_output == NULL) || (size_byte == 0U))
    {
      return HAL_INVALID_PARAM;
    }
  }
  else
#endif /* USE_HAL_AES_ECB_CBC_ALGO OR USE_HAL_AES_CTR_ALGO */
  {
#if (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)) \
     || (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))
    if ((p_input == NULL) && (size_byte != 0U))
    {
      return HAL_INVALID_PARAM;
    }
#endif /* USE_HAL_AES_GCM_GMAC_ALGO or USE_HAL_AES_CCM_ALGO */
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(haes, global_state, HAL_AES_STATE_IDLE, HAL_AES_STATE_ACTIVE);

  if (HAL_AES_GetFlag(haes, HAL_AES_FLAG_KEYVALID) == 0U)
  {
    haes->global_state = HAL_AES_STATE_IDLE;
    return HAL_ERROR;
  }

#if defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)
  tmp_data_size_sum_byte = haes->data_size_sum_byte;
  if (
    ((haes->algorithm == AES_ALGORITHM_ECB)
     || (haes->algorithm == AES_ALGORITHM_CBC))
    && (tmp_data_size_sum_byte == 0U)
  )
  {
    if (AES_KeyDerivation(haes) != HAL_OK)
    {
      haes->global_state = HAL_AES_STATE_IDLE;
      return HAL_ERROR;
    }
  }
#endif /* USE_HAL_AES_ECB_CBC_ALGO */

  HAL_AES_ClearFlagRDWRERR(haes);
#if defined(USE_HAL_AES_GET_LAST_ERRORS) && (USE_HAL_AES_GET_LAST_ERRORS == 1)
  haes->last_error_codes = HAL_AES_ERROR_NONE;
#endif /* USE_HAL_AES_GET_LAST_ERRORS */

#if defined(AES_CR_KMOD)
  /* Set decrypt mode
     SAES key mode must be normal to do a decryption with any key:
     SAES keys (normal,HW)
     or to use a wrapped key
     or to use a shared key (unshare key)
     AES key mode must be normal when encrypt/decrypt */
  STM32_MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_MODE | AES_CR_KMOD, AES_OPERATING_MODE_DECRYPT);
#else
  STM32_MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_MODE, AES_OPERATING_MODE_DECRYPT);
#endif /* defined(AES_CR_KMOD) */

  haes->p_in_buff = (const uint32_t *)p_input;
  haes->p_out_buff = (uint32_t *)p_output;
  haes->data_size_byte = size_byte;
  haes->block_count = 0U;

#if (defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)) \
    || (defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1))
  if ((haes->algorithm == AES_ALGORITHM_ECB) || (haes->algorithm == AES_ALGORITHM_CBC)
      || (haes->algorithm == AES_ALGORITHM_CTR))
  {
    /* Enable interrupts and Process one block to generate computation complete interrupt */
    AES_ECB_CBC_CTR_Start_Process_IT(haes);
  }
  else
#endif /* USE_HAL_AES_ECB_CBC_ALGO OR USE_HAL_AES_CTR_ALGO */
  {
#if (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)) \
     || (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))
    /* The computation complete interrupt is generated with:
      - Case 1: Accomplish the Init phase for first encrypt call
      - Case 2: Skip the Init phase in case of processing the message with several encrypt runs */
    if (AES_GCM_GMAC_CCM_Start_Process_IT(haes) != HAL_OK)
    {
      return HAL_ERROR;
    }
#endif /* USE_HAL_AES_GCM_GMAC_ALGO or USE_HAL_AES_CCM_ALGO */
  }

  return HAL_OK;
}

#if defined(USE_HAL_AES_DMA) && (USE_HAL_AES_DMA == 1)
/**
  * @brief  Encrypt user data in DMA mode.
  *       - For ECB, CBC or CTR algorithms:
  *                           - The padding is not supported.
  *                           - Only the encryption of the plaintext is available (no preparation for tag generation).
  *       - For GCM algorithm:- HAL_AES_Encrypt_DMA() is used either to:
  *                           - Encrypt a plaintext and use the header to prepare for the tag generation.
  *                           - Or just do the encryption (header null).
  *                           - Or just prepare for tag generation (plaintext null).
  *       - For GMAC algorithm: Prepare for the tag generation only (plaintext null).
  *       - For CCM algorithm:- HAL_AES_Encrypt_DMA() is used either to:
  *                           - Encrypt a plaintext and use the header to prepare for the tag generation.
  *                           - Or just do the encryption (header null).
  *                           - Or just prepare for tag generation (plaintext null)(not recommended by NIST).
  * @param   haes              Pointer to a @ref hal_aes_handle_t structure
  * @param   p_input           Pointer to aligned **const void** plaintext
  * @param   size_byte         Length of the plaintext buffer that must be in byte
  * @param   p_output          Pointer to aligned **void** data buffer to be filled with the encrypted text
  * @warning No swapped user data must be provided in big-endian. When data are provided in little-endian, the user must
  *          configure the swapping mode before starting the process (ex when data are provided as little-endian bytes,
  *          the swap mode must be set to HAL_AES_BYTE_SWAP or when data are provided as little-endian halfwords, the
  *          swap mode must be set to HAL_AES_HALFWORD_SWAP)
  * @retval  HAL_INVALID_PARAM For ECB, CBC or CTR algorithms Invalid param return when:
  *                             - The provided input data buffer pointer is null
  *                             - Or the output data buffer pointer is null
  *                             - Or the input buffer is empty
  *                            For GCM_GMAC or CCM algorithms Invalid param return when:
  *                             - The provided input data buffer pointer is null but its size is # 0U
  *                            The handle pointer is null
  * @retval  HAL_BUSY          Another AES process is ongoing
  * @retval  HAL_ERROR         Error return when the loaded key is invalid
  * @retval  HAL_OK            AES encryption is successfully accomplished
  */
hal_status_t HAL_AES_Encrypt_DMA(hal_aes_handle_t *haes, const void *p_input, uint16_t size_byte, void *p_output)
{
#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((haes == NULL) || (haes->hdma_in == NULL) || (haes->hdma_out == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  ASSERT_DBG_PARAM(haes != NULL);
#if (defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)) \
     || (defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1))
  if ((haes->algorithm == AES_ALGORITHM_ECB) || (haes->algorithm == AES_ALGORITHM_CBC)
      || (haes->algorithm == AES_ALGORITHM_CTR))
  {
    ASSERT_DBG_PARAM(p_input != NULL);
    ASSERT_DBG_PARAM(p_output != NULL);
    ASSERT_DBG_PARAM(size_byte != 0U);
  }
#endif /* USE_HAL_AES_ECB_CBC_ALGO OR USE_HAL_AES_CTR_ALGO */
  ASSERT_DBG_STATE(haes->global_state, HAL_AES_STATE_IDLE);

