MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_aes.c
#if (defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)) \
     || (defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1))
  if ((haes->algorithm == AES_ALGORITHM_ECB) || (haes->algorithm == AES_ALGORITHM_CBC)
      || (haes->algorithm == AES_ALGORITHM_CTR))
  {
    ASSERT_DBG_PARAM(p_input != NULL);
    ASSERT_DBG_PARAM(p_output != NULL);
    ASSERT_DBG_PARAM(size_byte != 0U);
  }
#endif /* USE_HAL_AES_ECB_CBC_ALGO OR USE_HAL_AES_CTR_ALGO */
  ASSERT_DBG_STATE(haes->global_state, HAL_AES_STATE_IDLE);

#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
#if (defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)) \
     || (defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1))
  if ((haes->algorithm == AES_ALGORITHM_ECB) || (haes->algorithm == AES_ALGORITHM_CBC)
      || (haes->algorithm == AES_ALGORITHM_CTR))
  {
    if ((p_input == NULL) || (p_output == NULL) || (size_byte == 0U))
    {
      return HAL_INVALID_PARAM;
    }
  }
  else
#endif /* USE_HAL_AES_ECB_CBC_ALGO OR USE_HAL_AES_CTR_ALGO */
  {
#if (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)) \
     || (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))
    if ((p_input == NULL) && (size_byte != 0U))
    {
      return HAL_INVALID_PARAM;
    }
#endif /* USE_HAL_AES_GCM_GMAC_ALGO or USE_HAL_AES_CCM_ALGO */
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(haes, global_state, HAL_AES_STATE_IDLE, HAL_AES_STATE_ACTIVE);

  if (HAL_AES_GetFlag(haes, HAL_AES_FLAG_KEYVALID) == 0U)
  {
    haes->global_state = HAL_AES_STATE_IDLE;
    return HAL_ERROR;
  }

#if defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)
  tmp_data_size_sum_byte = haes->data_size_sum_byte;

  if (
    ((haes->algorithm == AES_ALGORITHM_ECB)
     || (haes->algorithm == AES_ALGORITHM_CBC))
    && (tmp_data_size_sum_byte  == 0U)
  )
  {
    if (AES_KeyDerivation(haes) != HAL_OK)
    {
      haes->global_state = HAL_AES_STATE_IDLE;
      return HAL_ERROR;
    }
  }
#endif /* USE_HAL_AES_ECB_CBC_ALGO */

  HAL_AES_ClearFlagRDWRERR(haes);
#if defined(USE_HAL_AES_GET_LAST_ERRORS) && (USE_HAL_AES_GET_LAST_ERRORS == 1)
  haes->last_error_codes = HAL_AES_ERROR_NONE;
#endif /* USE_HAL_AES_GET_LAST_ERRORS */

#if defined(AES_CR_KMOD)
  /* Set decrypt mode
     SAES key mode must be normal to do decryption with any key:
     SAES configurable keys (normal,HW)
     or using a wrapped key
     or using a shared key (unshare)
     AES key mode must be normal when encrypt/decrypt */
  STM32_MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_MODE | AES_CR_KMOD, AES_OPERATING_MODE_DECRYPT);
#else
  STM32_MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_MODE, AES_OPERATING_MODE_DECRYPT);
#endif /* defined(AES_CR_KMOD) */

  haes->p_in_buff = (const uint32_t *)p_input;
  haes->p_out_buff = (uint32_t *)p_output;
  haes->data_size_byte = size_byte;
  haes->block_count = 0U;

#if (defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)) \
   || (defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1))
  if ((haes->algorithm == AES_ALGORITHM_ECB) || (haes->algorithm == AES_ALGORITHM_CBC)
      || (haes->algorithm == AES_ALGORITHM_CTR))
  {
    if (AES_ECB_CBC_CTR_Process_DMA(haes) != HAL_OK)
    {
      return HAL_ERROR;
    }
  }
  else
#endif /* USE_HAL_AES_ECB_CBC_ALGO OR USE_HAL_AES_CTR_ALGO */
  {
#if (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)) \
     || (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))
    if (AES_GCM_GMAC_CCM_Process_DMA(haes) != HAL_OK)
    {
      return HAL_ERROR;
    }
#endif /* USE_HAL_AES_GCM_GMAC_ALGO or USE_HAL_AES_CCM_ALGO */
  }

  return HAL_OK;
}
#endif /* USE_HAL_AES_DMA */

#if defined(USE_HAL_AES_SUSPEND_RESUME) && (USE_HAL_AES_SUSPEND_RESUME == 1)
/**
  * @brief  Request suspension for AES interrupt mode processing.
  * @param  haes Pointer to a @ref hal_aes_handle_t structure
  * @note   Set the handle field suspend_request to HAL_AES_SUSPEND so that the on-going AES processing is suspended as
  *         soon as the required conditions are met (The current block is entirely processed and it's not the last one)
  * @retval HAL_INVALID_PARAM When the handle pointer is NULL.
  * @retval HAL_OK            The AES processing suspension is well requested
  */
hal_status_t HAL_AES_RequestSuspend(hal_aes_handle_t *haes)
{
  ASSERT_DBG_PARAM(haes != NULL);
#if defined(SAES)
  ASSERT_DBG_PARAM(IS_AES_SUSPEND_RESUME(haes->instance, haes->algorithm));
#endif /* SAES */
  ASSERT_DBG_STATE(haes->global_state, HAL_AES_STATE_ACTIVE);
#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (haes == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */
  haes->suspend_request = AES_SUSPEND;

  return HAL_OK;
}

/**
  * @brief  Resumption of the suspended AES processing.
  * @param  haes Pointer to a @ref hal_aes_handle_t structure
  * @note   Processing restarts at the exact point where it was suspended, if the AES context has been changed
  *         @ref HAL_AES_SaveContext and @ref HAL_AES_RestoreContext must be used before resumption.
  * @retval HAL_INVALID_PARAM When the handle pointer is NULL.
  * @retval HAL_BUSY          Another AES process is ongoing
  * @retval HAL_OK            AES suspended processing is resumed
  */
hal_status_t HAL_AES_Resume(hal_aes_handle_t *haes)
{
  ASSERT_DBG_PARAM(haes != NULL);
#if defined(SAES)
  ASSERT_DBG_PARAM(IS_AES_SUSPEND_RESUME(haes->instance, haes->algorithm));
#endif /* SAES */
  ASSERT_DBG_STATE(haes->global_state, HAL_AES_STATE_SUSPENDED);
#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (haes == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(haes, global_state, HAL_AES_STATE_SUSPENDED, HAL_AES_STATE_ACTIVE);

