MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_aes.c
#if (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)) \
     || (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))
  if ((haes->algorithm == AES_ALGORITHM_CCM)
      || ((haes->algorithm == AES_ALGORITHM_GCM_GMAC) && (haes->instance == HAL_AES)))
  {
    AES_ENABLE(haes);

    if (STM32_READ_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_CPHASE) == AES_PHASE_HEADER)
    {
      AES_SetHeaderPhase_IT(haes);
      HAL_AES_EnableIT(haes, HAL_AES_IT_ALL);
    }
    else
    {
      AES_StartPayloadPhase_IT(haes);
      HAL_AES_EnableIT(haes, HAL_AES_IT_ALL);
    }
  }
  else
#endif /* USE_HAL_AES_GCM_GMAC_ALGO or USE_HAL_AES_CCM_ALGO */
  {
#if (defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)) \
    || (defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1))
    /* Enable interrupts and Process one block to generate the computation complete interrupt */
    AES_ECB_CBC_CTR_Start_Process_IT(haes);

#endif /* USE_HAL_AES_ECB_CBC_ALGO OR USE_HAL_AES_CTR_ALGO */
  }

  return HAL_OK;
}

/**
  * @brief  Save parameters of the suspended AES processing.
  * @param  haes      Pointer to a @ref hal_aes_handle_t structure
  * @param  p_context Pointer to a @ref hal_aes_save_context_t structure where to store the parameters of the suspend
  *                   AES processing
  * @retval HAL_INVALID_PARAM The provided save context pointer structure or the handle pointer is null
  * @retval HAL_OK            AES suspended processing parameters are saved
  */
hal_status_t HAL_AES_SaveContext(hal_aes_handle_t *haes, hal_aes_save_context_t *p_context)
{
  ASSERT_DBG_PARAM(haes != NULL);
#if defined(SAES)
  ASSERT_DBG_PARAM(IS_AES_SUSPEND_RESUME(haes->instance, haes->algorithm));
#endif /* SAES */
  ASSERT_DBG_PARAM(p_context != NULL);
  ASSERT_DBG_STATE(haes->global_state, HAL_AES_STATE_SUSPENDED);

#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if (p_context == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (haes == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */
  AES_TypeDef *aes_instance = AES_GET_INSTANCE(haes);

#if (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)) \
    || (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))
  if ((haes->algorithm == AES_ALGORITHM_CCM)
      || ((haes->algorithm == AES_ALGORITHM_GCM_GMAC) && (haes->instance == HAL_AES)))
  {
    for (uint32_t i = 0U; i < 8U; i++)
    {
      p_context->SUSPRx[i] = ((volatile uint32_t *) & (aes_instance->SUSPR0))[7U - i];
    }
  }
#endif /* USE_HAL_AES_GCM_GMAC_ALGO or USE_HAL_AES_CCM_ALGO */

  if (haes->algorithm != AES_ALGORITHM_ECB)
  {
    /* Save Initialization Vector registers */
    p_context->iv_buff[0] = aes_instance->IVR3;
    p_context->iv_buff[1] = aes_instance->IVR2;
    p_context->iv_buff[2] = aes_instance->IVR1;
    p_context->iv_buff[3] = aes_instance->IVR0;
  }
  AES_DISABLE(haes);

  /* Save the configuration register */
  p_context->CR                 = aes_instance->CR;
  p_context->instance           = haes->instance;
  p_context->previous_state     = haes->global_state;
  p_context->algorithm          = haes->algorithm;
  p_context->data_size_byte     = haes->data_size_byte;
  p_context->data_size_sum_byte = haes->data_size_sum_byte;
  p_context->p_in_buff          = haes->p_in_buff;
  p_context->p_out_buff         = haes->p_out_buff;
  p_context->block_count        = haes->block_count;
#if (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)) \
     || (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))
  p_context->p_header           = haes->p_header;
  p_context->header_size_byte   = haes->header_size_byte;
#endif /* USE_HAL_AES_GCM_GMAC_ALGO or USE_HAL_AES_CCM_ALGO */
  p_context->suspend_request    = haes->suspend_request;
  p_context->p_key              = haes->p_key;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
  p_context->p_in_cplt_cb       = haes->p_in_cplt_cb;
  p_context->p_out_cplt_cb      = haes->p_out_cplt_cb;
  p_context->p_error_cb         = haes->p_error_cb;
  p_context->p_suspend_cb       = haes->p_suspend_cb;
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */

  haes->global_state = HAL_AES_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Resumption for the saved parameters of the suspended AES processing.
  * @param  haes      Pointer to a @ref hal_aes_handle_t structure
  * @param  p_context Pointer to a @ref hal_aes_save_context_t structure where the parameters of the suspend AES
  *                   processing are stored
  * @retval HAL_INVALID_PARAM When the handle pointer is NULL.
  * @retval HAL_ERROR         AES key derivation exceeds the dedicated timeout
  * @retval HAL_OK            AES suspended processing parameters are restored
  */
hal_status_t HAL_AES_RestoreContext(hal_aes_handle_t *haes, const hal_aes_save_context_t *p_context)
{
  ASSERT_DBG_PARAM(haes != NULL);
#if defined(SAES)
  ASSERT_DBG_PARAM(IS_AES_SUSPEND_RESUME(haes->instance, haes->algorithm));
#endif /* SAES */
  ASSERT_DBG_PARAM(p_context != NULL);
  ASSERT_DBG_PARAM(p_context->previous_state == HAL_AES_STATE_SUSPENDED);

  ASSERT_DBG_STATE(haes->global_state, HAL_AES_STATE_IDLE);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (haes == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */
  AES_TypeDef *aes_instance = AES_GET_INSTANCE(haes);

  AES_DISABLE(haes);

  aes_instance->CR         = p_context->CR;
  haes->instance           = p_context->instance;
  haes->algorithm          = p_context->algorithm;
  haes->data_size_byte     = p_context->data_size_byte;
  haes->data_size_sum_byte = p_context->data_size_sum_byte;
  haes->p_in_buff          = p_context->p_in_buff;
  haes->p_out_buff         = p_context->p_out_buff;
  haes->block_count        = p_context->block_count;

