MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_aes.c
#if (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)) \
     || (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))
  haes->p_header           = p_context->p_header;
  haes->header_size_byte   = p_context->header_size_byte;
#endif /* USE_HAL_AES_GCM_GMAC_ALGO or USE_HAL_AES_CCM_ALGO */
  haes->suspend_request    = p_context->suspend_request;
  haes->p_key              = p_context->p_key;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
  haes->p_in_cplt_cb       = p_context->p_in_cplt_cb;
  haes->p_out_cplt_cb      = p_context->p_out_cplt_cb;
  haes->p_error_cb         = p_context->p_error_cb;
  haes->p_suspend_cb       = p_context->p_suspend_cb;
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */

  uint32_t key_size = STM32_READ_BIT(aes_instance->CR, AES_CR_KEYSIZE);

  if (haes->algorithm != AES_ALGORITHM_ECB)
  {
    AES_SetIV(haes, p_context->iv_buff);
  }

#if defined(SAES)
  if (STM32_READ_BIT(aes_instance->CR, AES_CR_KEYSEL) == 0U)
  {
    AES_SetNormalKey(haes, (hal_aes_key_size_t)key_size, haes->p_key);
  }
#else
  AES_SetNormalKey(haes, (hal_aes_key_size_t)key_size, haes->p_key);
#endif /* defined(SAES) */

#if defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)
  if ((STM32_READ_BIT(aes_instance->CR, AES_CR_MODE) == AES_OPERATING_MODE_DECRYPT)
      && ((haes->algorithm == AES_ALGORITHM_ECB) || (haes->algorithm == AES_ALGORITHM_CBC)))
  {
    if (AES_KeyDerivation(haes) != HAL_OK)
    {
      return HAL_ERROR;
    }

#if defined(AES_CR_KMOD)
    STM32_MODIFY_REG(aes_instance->CR, AES_CR_MODE | AES_CR_KMOD, AES_OPERATING_MODE_DECRYPT);
#else
    STM32_MODIFY_REG(aes_instance->CR, AES_CR_MODE, AES_OPERATING_MODE_DECRYPT);
#endif /* defined(AES_CR_KMOD) */
  }
#endif /* USE_HAL_AES_ECB_CBC_ALGO */

#if (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)) \
     || (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))
  if ((haes->algorithm == AES_ALGORITHM_CCM)
      || ((haes->algorithm == AES_ALGORITHM_GCM_GMAC) && (haes->instance == HAL_AES)))
  {
    for (uint32_t i = 0U; i < 8U; i++)
    {
      ((volatile uint32_t *) & (aes_instance->SUSPR0))[7U - i] = p_context->SUSPRx[i];
    }
  }
#endif /* USE_HAL_AES_GCM_GMAC_ALGO or USE_HAL_AES_CCM_ALGO */

  haes->global_state = HAL_AES_STATE_SUSPENDED;

  return HAL_OK;
}
#endif /* USE_HAL_AES_SUSPEND_RESUME */
/**
  * @}
  */

/** @addtogroup AES_Exported_Functions_Group4
  * @{
This subsection provides the IRQHandler and a set of callback functions allowing to manage the data transfer between the
user input/output buffer and the AES/SAES peripheral:
  - HAL_AES_IRQHandler():Allowing to handle the AES interrupts

  - HAL_AES_InCpltCallback():Input transfer complete callback
  - HAL_AES_OutCpltCallback():Output transfer complete callback
  - HAL_AES_ErrorCallback():Error callback
  - HAL_AES_SuspendCallback():Suspend callback

  - HAL_AES_RegisterInTransferCpltCallback():Allowing to register the input transfer complete callback
  - HAL_AES_RegisterOutTransferCpltCallback():Allowing to register the output transfer complete callback
  - HAL_AES_RegisterErrorCallback():Allowing to register the error callback
  - HAL_AES_RegisterSuspendCallback():Allowing to register the suspend callback

  - HAL_AES_SetInDMA():Allowing to link the input FIFO HAL DMA handle into the HAL AES handle
  - HAL_AES_SetOutDMA():Allowing to link the output FIFO HAL DMA handle into the HAL AES handle

  */
/**
  * @brief Handle any AES interrupt.
  * @param haes Pointer to a @ref hal_aes_handle_t structure
  */
void HAL_AES_IRQHandler(hal_aes_handle_t *haes)
{
  uint32_t its;
  uint32_t flags_sr;
  uint32_t flags_isr;

  ASSERT_DBG_PARAM(haes != NULL);

  its = STM32_READ_REG(AES_GET_INSTANCE(haes)->IER);
  flags_sr = STM32_READ_REG(AES_GET_INSTANCE(haes)->SR);
  flags_isr = STM32_READ_REG(AES_GET_INSTANCE(haes)->ISR);

  /* Check if Read or write error occurred */
  if (STM32_READ_BIT((flags_isr & its), HAL_AES_FLAG_RDWRERR) != 0U)
  {
    /* If non blocking write Error occurred */
    if ((flags_sr & HAL_AES_FLAG_WRERR) != 0U)
    {
#if defined(USE_HAL_AES_GET_LAST_ERRORS) && (USE_HAL_AES_GET_LAST_ERRORS == 1)
      haes->last_error_codes |= HAL_AES_ERROR_WRITE;
#endif /* USE_HAL_AES_GET_LAST_ERRORS */
    }

    /* If non blocking read Error occurred */
    if ((flags_sr & HAL_AES_FLAG_RDERR) != 0U)
    {
#if defined(USE_HAL_AES_GET_LAST_ERRORS) && (USE_HAL_AES_GET_LAST_ERRORS == 1)
      haes->last_error_codes |= HAL_AES_ERROR_READ;
#endif /* USE_HAL_AES_GET_LAST_ERRORS */
    }

    HAL_AES_ClearFlagRDWRERR(haes);
  }

  /* Check if Key error occurred */
  if (STM32_READ_BIT((flags_isr & its), HAL_AES_FLAG_KERR) != 0U)
  {
#if defined(USE_HAL_AES_GET_LAST_ERRORS) && (USE_HAL_AES_GET_LAST_ERRORS == 1)
    haes->last_error_codes |= HAL_AES_ERROR_KEY;
#endif /* USE_HAL_AES_GET_LAST_ERRORS */
  }

#if defined(SAES)
  /* Check if RNG error occurred */
  if (STM32_READ_BIT((flags_isr & its), HAL_AES_FLAG_RNGERR) != 0U)
  {
#if defined(USE_HAL_AES_GET_LAST_ERRORS) && (USE_HAL_AES_GET_LAST_ERRORS == 1)
    haes->last_error_codes |= HAL_AES_ERROR_RNG;
#endif /* USE_HAL_AES_GET_LAST_ERRORS */
  }
#endif /* SAES */

#if defined(SAES)
  if (STM32_READ_BIT((flags_isr & its), HAL_AES_FLAG_KERR | HAL_AES_FLAG_RNGERR) != 0U)
#else
  if (STM32_READ_BIT((flags_isr & its), HAL_AES_FLAG_KERR) != 0U)
#endif /* SAES */
  {
    HAL_AES_ClearFlagKERR(haes);

#if defined(SAES)
    HAL_AES_ClearFlagRNGERR(haes);
#endif /* SAES */

    haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
    haes->p_error_cb(haes);
#else
    HAL_AES_ErrorCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */

    return;
  }

  if (STM32_READ_BIT((flags_isr & its), HAL_AES_FLAG_CC) != 0U)
  {
    HAL_AES_ClearFlagCC(haes);

#if (defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)) \
     || (defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1))
    if ((haes->algorithm == AES_ALGORITHM_ECB) || (haes->algorithm == AES_ALGORITHM_CBC)
        || (haes->algorithm == AES_ALGORITHM_CTR))
    {
      /* Process data in IT mode: Each block write to DINR generates a computation complete interrupt */
      AES_ECB_CBC_CTR_Process_IT(haes);
    }
    else
#endif /* USE_HAL_AES_ECB_CBC_ALGO OR USE_HAL_AES_CTR_ALGO */
    {
#if (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)) \
     || (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))
      /* A computation complete interrupt generated via INIT phase */
      if (STM32_READ_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_CPHASE) == AES_PHASE_INIT)
      {
        /* Set header phase */
        if (haes->header_size_byte != 0U)
        {
          STM32_MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_CPHASE, AES_PHASE_HEADER);
          AES_ENABLE(haes);
          AES_SetHeaderPhase_IT(haes);
        }
        /* Skip header phase (header null) and start payload phase */
        else
        {
          STM32_MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_CPHASE, AES_PHASE_PAYLOAD);
          AES_ENABLE(haes);
          AES_StartPayloadPhase_IT(haes);
        }
      }
      /* A computation complete interrupt generated via HEADER phase */
      else if (STM32_READ_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_CPHASE) == AES_PHASE_HEADER)
      {
        /* Set header phase */
        AES_SetHeaderPhase_IT(haes);
      }
      /* A computation complete interrupt generated via PAYLOAD phase */
      else
      {
        /* Set payload phase */
        AES_SetPayloadPhase_IT(haes);
      }
#endif /* USE_HAL_AES_GCM_GMAC_ALGO or USE_HAL_AES_CCM_ALGO */
    }
  }
}

/**
  * @brief Input FIFO transfer completed callback.
  * @param haes Pointer to a @ref hal_aes_handle_t structure
  */
__WEAK void HAL_AES_InCpltCallback(hal_aes_handle_t *haes)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(haes);

  /* NOTE: This function must not be modified, when the callback is needed,
  the HAL_AES_InCpltCallback could be implemented in the user file
  */
}

/**
  * @brief Output FIFO transfer completed callback.
  * @param haes Pointer to a @ref hal_aes_handle_t structure
  */
__WEAK void HAL_AES_OutCpltCallback(hal_aes_handle_t *haes)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(haes);

  /* NOTE: This function must not be modified, when the callback is needed,
  the HAL_AES_OutCpltCallback could be implemented in the user file
  */
}

/**
  * @brief Error callback.
  * @param haes Pointer to a @ref hal_aes_handle_t structure
  */
__WEAK void HAL_AES_ErrorCallback(hal_aes_handle_t *haes)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(haes);

  /* NOTE: This function must not be modified, when the callback is needed,
  the HAL_AES_ErrorCallback could be implemented in the user file
  */
}

#if defined(USE_HAL_AES_SUSPEND_RESUME) && (USE_HAL_AES_SUSPEND_RESUME == 1)
/**
  * @brief Suspend callback.
  * @param haes Pointer to a @ref hal_aes_handle_t structure
  */
__WEAK void HAL_AES_SuspendCallback(hal_aes_handle_t *haes)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(haes);

  /* NOTE: This function must not be modified, when the callback is needed,
  the HAL_AES_SuspendCallback could be implemented in the user file
  */
}
#endif /* defined (USE_HAL_AES_SUSPEND_RESUME) */

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register the input transfer complete callback.
  * @param  haes              Pointer to a @ref hal_aes_handle_t structure
  * @param  p_callback        Pointer to the hal_aes_cb_t callback function.
  * @retval HAL_INVALID_PARAM When the callback pointer is NULL.
  * @retval HAL_OK            Callback registered successfully.
  */
hal_status_t HAL_AES_RegisterInTransferCpltCallback(hal_aes_handle_t *haes, hal_aes_cb_t p_callback)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  haes->p_in_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the output transfer complete callback.
  * @param  haes              Pointer to a @ref hal_aes_handle_t structure
  * @param  p_callback        Pointer to the hal_aes_cb_t callback function.
  * @retval HAL_INVALID_PARAM When the callback pointer is NULL.
  * @retval HAL_OK            Callback registered successfully.
  */
hal_status_t HAL_AES_RegisterOutTransferCpltCallback(hal_aes_handle_t *haes, hal_aes_cb_t p_callback)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  haes->p_out_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the error callback.
  * @param  haes              Pointer to a @ref hal_aes_handle_t structure
  * @param  p_callback        Pointer to the hal_aes_cb_t callback function.
  * @retval HAL_INVALID_PARAM When the callback pointer is NULL.
  * @retval HAL_OK            Callback registered successfully.
  */
hal_status_t HAL_AES_RegisterErrorCallback(hal_aes_handle_t *haes, hal_aes_cb_t p_callback)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  haes->p_error_cb = p_callback;

  return HAL_OK;
}

#if defined(USE_HAL_AES_SUSPEND_RESUME) && (USE_HAL_AES_SUSPEND_RESUME == 1)
/**
  * @brief  Register the suspend callback.
  * @param  haes              Pointer to a @ref hal_aes_handle_t structure
  * @param  p_callback        Pointer to the hal_aes_cb_t callback function.
  * @retval HAL_INVALID_PARAM When the callback pointer is NULL.
  * @retval HAL_OK            Callback registered successfully.
  */
hal_status_t HAL_AES_RegisterSuspendCallback(hal_aes_handle_t *haes, hal_aes_cb_t p_callback)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  haes->p_suspend_cb = p_callback;

  return HAL_OK;
}
#endif /* defined (USE_HAL_AES_SUSPEND_RESUME) */
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */

#if defined(USE_HAL_AES_DMA) && (USE_HAL_AES_DMA == 1)
/**
  * @brief  Link/Store Input FIFO HAL DMA handle into the HAL AES handle.
  * @param  haes     Pointer to a @ref hal_aes_handle_t structure
  * @param  hdma_in  Pointer to a hal_dma_handle_t
  * @retval HAL_INVALID_PARAM When the DMA handle pointer is NULL
  * @retval HAL_OK            The DMA handle has been correctly linked to the AES handle
  */
hal_status_t HAL_AES_SetInDMA(hal_aes_handle_t *haes, hal_dma_handle_t *hdma_in)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(hdma_in != NULL);
  ASSERT_DBG_STATE(haes->global_state, (uint32_t)HAL_AES_STATE_INIT | (uint32_t)HAL_AES_STATE_IDLE);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma_in == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  haes->hdma_in     = hdma_in;
  hdma_in->p_parent = haes;

  return HAL_OK;
}

/**
  * @brief  Link/Store Output FIFO HAL DMA handle into the HAL AES handle.
  * @param  haes      Pointer to a @ref hal_aes_handle_t structure
  * @param  hdma_out  Pointer to a hal_dma_handle_t
  * @retval HAL_INVALID_PARAM When the DMA handle pointer is NULL
  * @retval HAL_OK            The DMA handle has been correctly linked to the AES handle
  */
hal_status_t HAL_AES_SetOutDMA(hal_aes_handle_t *haes, hal_dma_handle_t *hdma_out)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(hdma_out != NULL);
  ASSERT_DBG_STATE(haes->global_state, (uint32_t)HAL_AES_STATE_INIT | (uint32_t)HAL_AES_STATE_IDLE);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma_out == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

