MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_aes.c
  haes->hdma_out     = hdma_out;
  hdma_out->p_parent = haes;

  return HAL_OK;
}
#endif /* USE_HAL_AES_DMA */

/**
  * @}
  */

/** @addtogroup AES_Exported_Functions_Group5
  * @{
This subsection provides a set of functions allowing to get the AES error information and state:
  - HAL_AES_GetState():Allowing to retrieve the AES state
  - HAL_AES_GetLastErrorCodes():Allowing to retrieve the AES error code
  - HAL_AES_SetUserData():Allowing to store application user data pointer into the handle
  - HAL_AES_GetUserData():Allowing to retrieve the application user data pointer from the handle
  - HAL_AES_CBC_GetLastOutputIV():Allowing to retrieve the the last output IV for CBC mode.
  - HAL_AES_CTR_GetLastOutputIV():Allowing to retrieve the the last output IV for CTR mode.
  */
/**
  * @brief  Retrieve the HAL AES Global State.
  * @param  haes                    Pointer to a @ref hal_aes_handle_t structure
  * @retval HAL_AES_STATE_RESET     AES/SAES peripheral is not yet initialized
  * @retval HAL_AES_STATE_INIT      AES/SAES peripheral is initialized but not yet configured
  * @retval HAL_AES_STATE_IDLE      AES/SAES peripheral is initialized and configured
  * @retval HAL_AES_STATE_ACTIVE    AES internal processing is ongoing
  * @retval HAL_AES_STATE_SUSPENDED AES internal processing is suspended
  */
hal_aes_state_t HAL_AES_GetState(const hal_aes_handle_t *haes)
{
  ASSERT_DBG_PARAM(haes != NULL);

  return haes->global_state;
}

#if defined(USE_HAL_AES_GET_LAST_ERRORS) && (USE_HAL_AES_GET_LAST_ERRORS == 1)
/**
  * @brief  Get last error codes.
  * @param  haes     Pointer to a @ref hal_aes_handle_t structure
  * @retval uint32_t Last error codes which can be a combination of @ref AES_Error_Code
  */
uint32_t HAL_AES_GetLastErrorCodes(const hal_aes_handle_t *haes)
{
  ASSERT_DBG_PARAM(haes != NULL);

  return haes->last_error_codes;
}
#endif /* USE_HAL_AES_GET_LAST_ERRORS */

#if defined (USE_HAL_AES_USER_DATA) && (USE_HAL_AES_USER_DATA == 1)
/**
  * @brief  Store application user data pointer into the handle.
  * @param  haes        Pointer to a @ref hal_aes_handle_t structure
  * @param  p_user_data Pointer to the user data
  */
void HAL_AES_SetUserData(hal_aes_handle_t *haes, const void *p_user_data)
{
  ASSERT_DBG_PARAM(haes != NULL);

  haes->p_user_data = p_user_data;
}

/**
  * @brief  Retrieve the application user data pointer from the handle.
  * @param  haes Pointer to a @ref hal_aes_handle_t structure
  * @retval Pointer to the user data
  */
const void *HAL_AES_GetUserData(const hal_aes_handle_t *haes)
{
  ASSERT_DBG_PARAM(haes != NULL);

  return (haes->p_user_data);
}
#endif /* USE_HAL_AES_USER_DATA == 1 */
/**
  * @}
  */

#if (defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1))
/**
  * @brief  Get the last output IV for CBC mode.
  * @param  haes              Pointer to a @ref hal_aes_handle_t structure
  * @param  p_last_iv         Pointer to the user buffer to be updated with the last output IV
  * @param  last_iv_size      Size of the p_last_iv buffer
  * @retval HAL_INVALID_PARAM Invalid param return when the provided last output IV pointer is null
  *                           or the handle pointer is null
  * @retval HAL_ERROR         Error return when the selected algorithm is not CBC algorithm or when
  *                           the data_size_sum_byte is null
  * @retval HAL_OK            AES process is successfully accomplished
  */
hal_status_t HAL_AES_CBC_GetLastOutputIV(const hal_aes_handle_t *haes, const uint8_t *p_last_iv, uint8_t last_iv_size)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(p_last_iv != NULL);
  ASSERT_DBG_STATE(haes->global_state, HAL_AES_STATE_IDLE);

#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if ((haes == NULL) || (p_last_iv == NULL))
  {
    return HAL_INVALID_PARAM;
  }
  if (last_iv_size != 16U)
  {
    return HAL_INVALID_PARAM;
  }
#else
  /* Prevent unused argument compilation warning */
  STM32_UNUSED(last_iv_size);
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

  if (haes->algorithm != AES_ALGORITHM_CBC)
  {
    return HAL_ERROR;
  }

  if (haes->data_size_sum_byte == 0U)
  {
    return HAL_ERROR;
  }
  else
  {
    /* Read the IV registers and store them in the user buffer */
    uint32_t last_iv = (uint32_t)p_last_iv;

    *(uint32_t *)(last_iv) = (uint32_t)(AES_GET_INSTANCE(haes)->IVR3);
    last_iv += 4U;
    *(uint32_t *)(last_iv) = (uint32_t)(AES_GET_INSTANCE(haes)->IVR2);
    last_iv += 4U;
    *(uint32_t *)(last_iv) = (uint32_t)(AES_GET_INSTANCE(haes)->IVR1);
    last_iv += 4U;
    *(uint32_t *)(last_iv) = (uint32_t)(AES_GET_INSTANCE(haes)->IVR0);

    return HAL_OK;
  }
}
#endif /* USE_HAL_AES_ECB_CBC_ALGO*/
#if (defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1))
/**
  * @brief  Get the last output IV for CTR mode.
  * @param  haes              Pointer to a @ref hal_aes_handle_t structure
  * @param  p_last_iv         Pointer to the user buffer to be updated with the last output IV
  * @param  last_iv_size      Size of the p_last_iv buffer
  * @retval HAL_INVALID_PARAM Invalid param return when the provided last output IV pointer is null
  *                           or the handle pointer is null
  * @retval HAL_ERROR         Error return when the selected algorithm is not CTR algorithm or when
  *                           the data_size_sum_byte is null
  * @retval HAL_OK            AES process is successfully accomplished
  */
hal_status_t HAL_AES_CTR_GetLastOutputIV(const hal_aes_handle_t *haes, const uint8_t *p_last_iv, uint8_t last_iv_size)
{
  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(p_last_iv != NULL);
  ASSERT_DBG_STATE(haes->global_state, HAL_AES_STATE_IDLE);

#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if ((haes == NULL) || (p_last_iv == NULL))
  {
    return HAL_INVALID_PARAM;
  }
  if (last_iv_size != 16U)
  {
    return HAL_INVALID_PARAM;
  }
#else
  /* Prevent unused argument compilation warning */
  STM32_UNUSED(last_iv_size);
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

  if (haes->algorithm != AES_ALGORITHM_CTR)
  {
    return HAL_ERROR;
  }

