MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_aes.c
  if (haes->data_size_sum_byte == 0U)
  {
    return HAL_ERROR;
  }
  else
  {
    /* Read the IV registers and store them in the user buffer */
    uint32_t last_iv = (uint32_t)p_last_iv;

    *(uint32_t *)(last_iv) = (uint32_t)(AES_GET_INSTANCE(haes)->IVR3);
    last_iv += 4U;
    *(uint32_t *)(last_iv) = (uint32_t)(AES_GET_INSTANCE(haes)->IVR2);
    last_iv += 4U;
    *(uint32_t *)(last_iv) = (uint32_t)(AES_GET_INSTANCE(haes)->IVR1);
    last_iv += 4U;
    *(uint32_t *)(last_iv) = (uint32_t)(AES_GET_INSTANCE(haes)->IVR0);

    return HAL_OK;
  }
}
#endif /*USE_HAL_AES_CTR_ALGO */

/** @addtogroup AES_Exported_Functions_Group6
  * @{
This subsection provides a set of functions allowing TAG generation for GCM and CCM algorithms:
 - HAL_AES_GCM_GenerateAuthTAG():Allowing to generate a tag for GCM algorithm
 - HAL_AES_CCM_GenerateAuthTAG():Allowing to generate a tag for CCM algorithm
  */

#if defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)
/**
  * @brief  Generate the GCM authentication TAG, available only with AES instance.
  *         This API can only be called after accomplishing either an encryption or a decryption process.
  * @param  haes              Pointer to a @ref hal_aes_handle_t structure
  * @param  p_auth_tag        Pointer to the authentication buffer the p_auth_tag generated here is 128bits length,
  *                           if the TAG length is less than 128bits, user must consider only the valid part of
  *                           p_auth_tag buffer which corresponds exactly to TAG length.
  * @param  timeout_ms        Specify Timeout value in milliseconds
  * @retval HAL_INVALID_PARAM The provided input tag pointer is null
  * @retval HAL_BUSY          Another AES process is ongoing
  * @retval HAL_TIMEOUT       AES tag generation exceeds user timeout
  * @retval HAL_ERROR         AES tag generation sequence is not well performed
  * @retval HAL_OK            AES tag is successfully generated
  */
hal_status_t HAL_AES_GCM_GenerateAuthTAG(hal_aes_handle_t *haes, uint32_t *p_auth_tag, uint32_t timeout_ms)
{
  uint32_t headerlength;
  uint32_t inputlength;
  uint32_t *p_tmp_auth_tag;
  uint32_t phase;

  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(p_auth_tag != NULL);
  ASSERT_DBG_PARAM(haes->algorithm == AES_ALGORITHM_GCM_GMAC);
  ASSERT_DBG_STATE(haes->global_state, HAL_AES_STATE_IDLE);

#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if (p_auth_tag == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((haes == NULL) || (timeout_ms == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(haes, global_state, HAL_AES_STATE_IDLE, HAL_AES_STATE_ACTIVE);

  HAL_AES_ClearFlagRDWRERR(haes);
#if defined(USE_HAL_AES_GET_LAST_ERRORS) && (USE_HAL_AES_GET_LAST_ERRORS == 1)
  haes->last_error_codes = HAL_AES_ERROR_NONE;
#endif /* USE_HAL_AES_GET_LAST_ERRORS */

  headerlength = (uint32_t)(haes->header_size_byte * 8U); /* Header length in bits */
  inputlength = (uint32_t)(haes->data_size_sum_byte * 8U); /* Input length in bits */
  p_tmp_auth_tag = p_auth_tag;

  phase = STM32_READ_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_CPHASE);
  if ((phase == AES_PHASE_HEADER) || (phase == AES_PHASE_PAYLOAD))
  {
    STM32_MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_CPHASE, AES_PHASE_FINAL);

    AES_GET_INSTANCE(haes)->DINR  = 0U;
    AES_GET_INSTANCE(haes)->DINR  = headerlength;
    AES_GET_INSTANCE(haes)->DINR  = 0U;
    AES_GET_INSTANCE(haes)->DINR  = inputlength;

    if (AES_WaitOnCCFlag(haes, timeout_ms) != HAL_OK)
    {
      haes->global_state = HAL_AES_STATE_IDLE;
      return HAL_TIMEOUT;
    }

    /* Read the authentication TAG from the output FIFO */
    for (uint32_t i = 0U; i < 4U; i++)
    {
      *p_tmp_auth_tag = AES_GET_INSTANCE(haes)->DOUTR;
      p_tmp_auth_tag ++;
    }
  }
  else
  {
    AES_DISABLE(haes);
    haes->global_state = HAL_AES_STATE_IDLE;
    return HAL_ERROR;
  }

  HAL_AES_ClearFlagCC(haes);
  AES_DISABLE(haes);

  haes->global_state = HAL_AES_STATE_IDLE;
  return HAL_OK;
}
#endif /* (USE_HAL_AES_GCM_GMAC_ALGO) */

#if defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1)
/**
  * @brief  Generate the CCM authentication TAG, available only with AES instance.
  *         This API can only be called after accomplishing either an encryption or a decryption process
  * @param  haes              Pointer to a @ref hal_aes_handle_t structure
  * @param  p_auth_tag        Pointer to the authentication buffer the p_auth_tag generated here is 128bits length,
  *                           if the TAG length is less than 128bits, user must consider only the valid part of
  *                           p_auth_tag buffer which corresponds exactly to TAG length.
  * @param  timeout_ms        Specify Timeout value in milliseconds
  * @retval HAL_INVALID_PARAM The provided input tag pointer is null
  * @retval HAL_BUSY          Another AES process is ongoing
  * @retval HAL_TIMEOUT       AES tag generation exceeds user timeout
  * @retval HAL_ERROR         AES tag generation sequence is not well performed
  * @retval HAL_OK            AES tag is successfully generated
  */
hal_status_t HAL_AES_CCM_GenerateAuthTAG(hal_aes_handle_t *haes, uint32_t *p_auth_tag, uint32_t timeout_ms)
{
  uint32_t *p_tmp_auth_tag;
  uint32_t phase;

  ASSERT_DBG_PARAM(haes != NULL);
  ASSERT_DBG_PARAM(p_auth_tag != NULL);
  ASSERT_DBG_PARAM(haes->algorithm == AES_ALGORITHM_CCM);
  ASSERT_DBG_STATE(haes->global_state, HAL_AES_STATE_IDLE);

#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if (p_auth_tag == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((haes == NULL) || (timeout_ms == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

