MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_aes.c
#if (defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)) \
   || (defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1)) \
   || (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)) \
   || (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1)) \
   || (defined(USE_HAL_AES_SUSPEND_RESUME) && (USE_HAL_AES_SUSPEND_RESUME == 1))
/**
  * @brief  Load the AES initial vector into IV registers.
  * @param  haes        Pointer to a @ref hal_aes_handle_t structure
  * @param  p_init_vect Pointer to **const uint32_t** four words buffer provided by the user. For the CTR algorithm, the
  *                     init vector is used to process each data block
  */
static void AES_SetIV(hal_aes_handle_t *haes, const uint32_t *p_init_vect)
{
  /* Store the instance in a local variable */
  AES_TypeDef *aes_instance = AES_GET_INSTANCE(haes);
  /* Set the Initialization Vector */
  aes_instance->IVR3 = *(const uint32_t *)p_init_vect;
  aes_instance->IVR2 = *(const uint32_t *)(p_init_vect + 1U);
  aes_instance->IVR1 = *(const uint32_t *)(p_init_vect + 2U);
  aes_instance->IVR0 = *(const uint32_t *)(p_init_vect + 3U);
}
#endif /* USE_HAL_AES_ECB_CBC_ALGO or USE_HAL_AES_CTR_ALGO or USE_HAL_AES_GCM_GMAC_ALGO or USE_HAL_AES_CCM_ALGO
          or USE_HAL_AES_SUSPEND_RESUME */

#if (defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)) \
   || (defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1)) \
   || (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)) \
   || (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))
/**
  * @brief  Process one block (equal to four words): Perform a write to DINR register and a read from DOUTR register.
  * @param  haes        Pointer to a @ref hal_aes_handle_t structure
  * @param  timeout_ms  Specify Timeout value in milliseconds
  * @retval HAL_TIMEOUT AES process exceeds user timeout
  * @retval HAL_OK      AES process is successfully accomplished
  */
static hal_status_t AES_ProcessOneblock(hal_aes_handle_t *haes, uint32_t timeout_ms)
{
  /* Store the instance in a local variable */
  AES_TypeDef *aes_instance = AES_GET_INSTANCE(haes);

  uint32_t offset_block_word = haes->block_count * AES_BLOCK_WORDS;
  uint32_t aes_output_block[4] = {0};

  /* Write one AES block (4 words) to the input FIFO to start processing */
  for (uint32_t i = 0U; i < AES_BLOCK_WORDS ; i++)
  {
    aes_instance->DINR  = haes->p_in_buff[offset_block_word + i];
  }

  if (AES_WaitOnCCFlag(haes, timeout_ms) != HAL_OK)
  {
    return HAL_TIMEOUT;
  }

  HAL_AES_ClearFlagCC(haes);

#if defined(SAES)
  /* The wrapped SAES application key can be used(encrypt/decrypt messages) only when it is decrypted but it must stay
     secret and can't be read after decryption */
  if (STM32_READ_BIT(aes_instance->CR, AES_CR_MODE | AES_CR_KMOD)
      != (AES_OPERATING_MODE_DECRYPT | (uint32_t)HAL_AES_KEY_MODE_WRAPPED))
#endif /* SAES */
  {
    for (uint32_t i = 0U; i < AES_BLOCK_WORDS ; i++)
    {
      aes_output_block[i] = aes_instance->DOUTR;
    }

    uint32_t limit = (haes->data_size_byte + (4U >> 1U)) / 4U;
    for (uint32_t i = 0U; ((i < 4U) && (offset_block_word < limit)); i++)
    {
      haes->p_out_buff[offset_block_word] = aes_output_block[i];
      offset_block_word++;
    }
  }
  return HAL_OK;
}

/**
  * @brief  Handle AES hardware block timeout when waiting for the computation complete flag to be raised.
  * @param  haes        Pointer to a @ref hal_aes_handle_t structure
  * @param  timeout_ms  Specify Timeout value in milliseconds
  * @retval HAL_TIMEOUT AES block computation exceeds user timeout
  * @retval HAL_OK      AES block computation is completed
  */
static hal_status_t AES_WaitOnCCFlag(hal_aes_handle_t *haes, uint32_t timeout_ms)
{
  uint32_t tickstart;

  /* Wait for computation complete flag to be raised */
  tickstart = HAL_GetTick();
  while (HAL_AES_GetFlag(haes, HAL_AES_FLAG_CC) == 0U)
  {
    /* Check for the Timeout */
    if ((HAL_GetTick() - tickstart) > timeout_ms)
    {
      AES_DISABLE(haes);
      return HAL_TIMEOUT;
    }
  }

  return HAL_OK;
}
#endif /* USE_HAL_AES_ECB_CBC_ALGO or USE_HAL_AES_CTR_ALGO or USE_HAL_AES_GCM_GMAC_ALGO
          or USE_HAL_AES_CCM_ALGO */

#if defined(SAES_BASE)
#if (defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)) \
    || (defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1)) \
    || (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)) \
    || (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))
/**
  * @brief  Handle AES hardware block timeout when waiting for the computation complete flag to be raised in
  *         non blocking mode.
  * @param  haes                 Pointer to a @ref hal_aes_handle_t structure
  * @param  latency_clock_cycle  Specify Latency value in clock cycles
  * @retval HAL_ERROR            AES block computation exceeds timeout
  * @retval HAL_OK               AES block computation is completed
  */
static hal_status_t AES_WaitOnCCFlag_NonBlocking(hal_aes_handle_t *haes, uint32_t latency_clock_cycle)
{
  uint32_t count = latency_clock_cycle;
  while (count > 0U)
  {
    count--;
    if (HAL_AES_GetFlag(haes, HAL_AES_FLAG_CC) != 0U)
    {
      return HAL_OK;
    }
  }
  AES_DISABLE(haes);
  return HAL_ERROR;
}
#endif /* USE_HAL_AES_ECB_CBC_ALGO or USE_HAL_AES_CTR_ALGO or USE_HAL_AES_GCM_GMAC_ALGO or USE_HAL_AES_CCM_ALGO */
#else
#if (defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)) \
    || (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)) \
    || (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))
/**
  * @brief  Handle AES hardware block timeout when waiting for the computation complete flag to be raised in
  *         non blocking mode.
  * @param  haes                 Pointer to a @ref hal_aes_handle_t structure
  * @param  latency_clock_cycle  Specify Latency value in clock cycles
  * @retval HAL_ERROR            AES block computation exceeds timeout
  * @retval HAL_OK               AES block computation is completed
  */
static hal_status_t AES_WaitOnCCFlag_NonBlocking(hal_aes_handle_t *haes, uint32_t latency_clock_cycle)
{
  uint32_t count = latency_clock_cycle;
  while (count > 0U)
  {
    count--;
    if (HAL_AES_GetFlag(haes, HAL_AES_FLAG_CC) != 0U)
    {
      return HAL_OK;
    }
  }
  AES_DISABLE(haes);
  return HAL_ERROR;
}
#endif /* USE_HAL_AES_ECB_CBC_ALGO or USE_HAL_AES_GCM_GMAC_ALGO or USE_HAL_AES_CCM_ALGO */
#endif /* SAES_BASE */

#if defined(USE_HAL_AES_DMA) && (USE_HAL_AES_DMA == 1)
/**
  * @brief  DMA AES error callback.
  *         This callback is generated when an error occurred during the DMA input or output transfer.
  * @param  hdma DMA handle
  */
static void AES_DMAError(hal_dma_handle_t *hdma)
{
  hal_aes_handle_t *haes = (hal_aes_handle_t *)(hdma->p_parent);

  /* Disable the DMA transfer */
  STM32_CLEAR_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_DMAINEN | AES_CR_DMAOUTEN);

  HAL_AES_ClearFlagCC(haes);

#if defined(USE_HAL_AES_GET_LAST_ERRORS) && (USE_HAL_AES_GET_LAST_ERRORS == 1)
  haes->last_error_codes |= HAL_AES_ERROR_DMA;
#endif /* USE_HAL_AES_GET_LAST_ERRORS */

  haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
  haes->p_error_cb(haes);
#else
  HAL_AES_ErrorCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
}
#endif /* USE_HAL_AES_DMA */

#if defined(SAES)
/**
  * @brief  Get the status of the fetch random numbers operation from RNG after enabling RNG and SAES clocks.
  * @param  haes      Pointer to a @ref hal_aes_handle_t structure
  * @retval HAL_ERROR Error detected while fetching a random number from RNG peripheral (only for SAES instance)
  * @retval HAL_OK    SAES fetching random number from RNG peripheral is well completed
  */
static hal_status_t AES_RNGFetchGetStatus(hal_aes_handle_t *haes)
{
  uint32_t tickstart;

  /* Verify no RNG random number fetch in progress */
  tickstart = HAL_GetTick();
  while (HAL_AES_GetFlag(haes, HAL_AES_FLAG_BUSY) != 0U)
  {
    /* Check for the Timeout */
    if ((HAL_GetTick() - tickstart) > AES_GENERAL_TIMEOUT_MS)
    {
      AES_DISABLE(haes);
      return HAL_ERROR;
    }
  }

  /* Verify no random number fetching error flagged */
  if (HAL_AES_GetFlag(haes, HAL_AES_FLAG_RNGERR) != 0U)
  {
#if defined(USE_HAL_AES_GET_LAST_ERRORS) && (USE_HAL_AES_GET_LAST_ERRORS == 1)
    haes->last_error_codes |= HAL_AES_ERROR_RNG;
#endif /* USE_HAL_AES_GET_LAST_ERRORS */
    HAL_AES_ClearFlagRDWRERR(haes);
    return HAL_ERROR;
  }

  return HAL_OK;
}
#endif /* SAES */

#if defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)
/**
  * @brief  AES key derivation: A mandatory step before decryption.
  * @param  haes      Pointer to a @ref hal_aes_handle_t structure
  * @retval HAL_ERROR AES key derivation is not yet completed and exceeds the timeout
  * @retval HAL_OK    AES key derivation is completed
  */
static hal_status_t AES_KeyDerivation(hal_aes_handle_t *haes)
{
  uint32_t key_derivation_latency = 0U;

  AES_DISABLE(haes);
  STM32_MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_MODE, AES_OPERATING_MODE_KEYDERIVATION);

  AES_ENABLE(haes);

  if (haes->instance == HAL_AES)
  {
    key_derivation_latency = AES_KEY_DERIVATION_LATENCY;
  }
#if defined(SAES)
  else
  {
    key_derivation_latency = SAES_KEY_DERIVATION_LATENCY;
  }
#endif /* SAES */

