MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_aes.c
  if (AES_WaitOnCCFlag_NonBlocking(haes, key_derivation_latency) != HAL_OK)
  {
    return HAL_ERROR;
  }

  HAL_AES_ClearFlagCC(haes);

  return HAL_OK;
}
#endif /* USE_HAL_AES_ECB_CBC_ALGO */

#if (defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)) \
 || (defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1))
/**
  * @brief  Process all user data by blocks from the user input buffer to the input data register and from the output
  *         data register to the output data buffer.
  *         The Padding is not supported.
  * @param  haes        Pointer to a @ref hal_aes_handle_t structure
  * @param  timeout_ms  Specify Timeout value in milliseconds
  * @retval HAL_TIMEOUT AES process exceeds user timeout
  * @retval HAL_OK      AES process is successfully accomplished
  */
static hal_status_t AES_ECB_CBC_CTR_Process(hal_aes_handle_t *haes, uint32_t timeout_ms)
{
  uint32_t data_block_numbers = (haes->data_size_byte + (AES_BLOCK_SIZE_BYTES - 1U)) / AES_BLOCK_SIZE_BYTES ;
  uint32_t block_count;

  AES_ENABLE(haes);
#if defined(SAES)
  /* Check the CCF flag after deriving the key from the CTR IV */
#if (defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1))
  AES_TypeDef *aes_instance = AES_GET_INSTANCE(haes);
  if (STM32_READ_BIT(aes_instance->CR,
                     (AES_CR_KMOD | AES_CR_CHMOD)) == (AES_CR_KMOD_0 | AES_CR_CHMOD_1))
  {
    if (AES_WaitOnCCFlag_NonBlocking(haes, AES_CTR_UNWRAP_LATENCY) != HAL_OK)
    {
      return HAL_ERROR;
    }
    HAL_AES_ClearFlagCC(haes);
  }
  else
#endif /* USE_HAL_AES_CTR_ALGO */
  {
#endif /* SAES */
    for (block_count = haes->block_count; block_count < data_block_numbers; block_count++)

    {
      haes->block_count = block_count;
      if (AES_ProcessOneblock(haes, timeout_ms) != HAL_OK)
      {
        return HAL_TIMEOUT;

      }

    }
#if defined(SAES)
  }
#endif /* SAES */
  AES_DISABLE(haes);

  uint32_t tmp_data_size_sum_byte = haes->data_size_sum_byte;
  haes->data_size_sum_byte = tmp_data_size_sum_byte + haes->data_size_byte;

  return HAL_OK;
}

/**
  * @brief Enable interrupts and Process one block from the user input buffer to the input data register.
  *        Once processed, a computation complete interrupt is then generated, the program enters the IRQHandler, reads
  *        the encrypted block from the output data register and performs the write of a new block, then a second
  *        interrupt is generated.
  * @param haes  Pointer to a @ref hal_aes_handle_t structure
  */
static void AES_ECB_CBC_CTR_Start_Process_IT(hal_aes_handle_t *haes)
{
  AES_TypeDef *aes_instance = AES_GET_INSTANCE(haes);
  uint32_t block_count = haes->block_count;

  AES_ENABLE(haes);

  /* Write one first block(4 words), then a computation Complete interrupt is generated */
  for (uint32_t i = 0U; i < AES_BLOCK_WORDS ; i++)
  {
    aes_instance->DINR = haes->p_in_buff[(block_count * AES_BLOCK_WORDS) + i];
  }

  HAL_AES_EnableIT(haes, HAL_AES_IT_ALL);
#if defined(SAES)
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  if (((uint32_t)(haes->instance) == (uint32_t)SAES_S) || ((uint32_t)(haes->instance) == (uint32_t)SAES_NS))
#else
  if (haes->instance == HAL_SAES)
#endif /* USE_HAL_SECURE_CHECK_PARAM */
  {
    HAL_AES_EnableIT(haes, HAL_AES_IT_RNGERR);
  }
#endif /* SAES */
}

/**
  * @brief AES interrupt process for ECB, CBC and CTR algorithms.
  *        Once a computation complete interrupt is generated, t, the program enters the IRQHandler, reads the
  *        encrypted block from the output data register and performs the write of a new block, then a second interrupt
  *        is generated.
  *        The Padding is not supported.
  * @param  haes  Pointer to a @ref hal_aes_handle_t structure
  */
static void AES_ECB_CBC_CTR_Process_IT(hal_aes_handle_t *haes)
{
  AES_TypeDef *aes_instance = AES_GET_INSTANCE(haes);
  uint32_t data_block_numbers = ((haes->data_size_byte + (AES_BLOCK_SIZE_BYTES - 1U)) / AES_BLOCK_SIZE_BYTES);
  uint32_t block_count = haes->block_count;
  uint32_t offset_block_word = block_count * AES_BLOCK_WORDS;
  uint32_t aes_output_block[4] = {0};

  /* Read from DOUTR */
  if (block_count < data_block_numbers)
  {
#if defined(SAES)
    /* The wrapped SAES application key can be used(encrypt/decrypt messages) only when it is decrypted but it must
       stay secret and can't be read after decryption */
    if (STM32_READ_BIT(aes_instance->CR,
                       AES_CR_MODE | AES_CR_KMOD) != (AES_OPERATING_MODE_DECRYPT | (uint32_t)HAL_AES_KEY_MODE_WRAPPED))
      /* Read from DOUTR after each computation complete interrupt: Start to read the first block processed
         via AES_ECB_CBC_CTR_Start_Process_IT */
#endif /* SAES */
    {
      for (uint32_t i = 0U; i < AES_BLOCK_WORDS ; i++)
      {
        aes_output_block[i] = aes_instance->DOUTR;
      }
      uint32_t limit = (haes->data_size_byte + (4U >> 1U)) / 4U;
      for (uint32_t i = 0U; ((i < 4U) && (offset_block_word < limit)); i++)
      {
        haes->p_out_buff[offset_block_word] = aes_output_block[i];
        offset_block_word++;
      }
    }

    /* Disable interrupts when all the data is processed (The padding is not supported for those algorithms) */
    if (block_count == (data_block_numbers - 1U))
    {
      uint32_t tmp_data_size_sum_byte = haes->data_size_sum_byte;
      haes->data_size_sum_byte = tmp_data_size_sum_byte + haes->data_size_byte;

      /* Disable Computation Complete flag and errors interrupts */
      HAL_AES_DisableIT(haes, HAL_AES_IT_ALL);
#if defined(SAES)
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
      if (((uint32_t)(haes->instance) == (uint32_t)SAES_S) || ((uint32_t)(haes->instance) == (uint32_t)SAES_NS))
#else
      if (haes->instance == HAL_SAES)
#endif /* USE_HAL_SECURE_CHECK_PARAM */
      {
        HAL_AES_DisableIT(haes, HAL_AES_IT_RNGERR);
      }
#endif /* SAES */

      AES_DISABLE(haes);

      haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
      haes->p_out_cplt_cb(haes);
#else
      HAL_AES_OutCpltCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
    }
  }

