MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_aes.c
  /* New block to be processed */
  block_count++;
  haes->block_count = block_count;

  /* Write to DINR generates a computation complete interrupt */
  if (block_count < data_block_numbers)
  {
#if defined(USE_HAL_AES_SUSPEND_RESUME) && (USE_HAL_AES_SUSPEND_RESUME == 1)
    /* A suspension is already requested */
    if (haes->suspend_request == AES_SUSPEND)
    {
      HAL_AES_ClearFlagCC(haes);

      haes->suspend_request = AES_SUSPEND_NONE;

      /* Disable Computation Complete flag and errors interrupts */
      HAL_AES_DisableIT(haes, HAL_AES_IT_ALL);
#if defined(SAES)
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
      if (((uint32_t)(haes->instance) == (uint32_t)SAES_S) || ((uint32_t)(haes->instance) == (uint32_t)SAES_NS))
#else
      if (haes->instance == HAL_SAES)
#endif /* USE_HAL_SECURE_CHECK_PARAM */
      {
        HAL_AES_DisableIT(haes, HAL_AES_IT_RNGERR);
      }
#endif /* SAES */

      AES_DISABLE(haes);

      haes->global_state = HAL_AES_STATE_SUSPENDED;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
      haes->p_suspend_cb(haes);
#else
      HAL_AES_SuspendCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
    }
    else
#endif /* USE_HAL_AES_SUSPEND_RESUME */
    {
      /* Write one AES block (4 words) to the input FIFO to start processing */
      for (uint32_t i = 0U; i < AES_BLOCK_WORDS ; i++)
      {
        aes_instance->DINR = haes->p_in_buff[(block_count * AES_BLOCK_WORDS) + i];
      }

      if (block_count == (data_block_numbers - 1U))
      {
#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
        haes->p_in_cplt_cb(haes);
#else
        HAL_AES_InCpltCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
      }
    }
  }
}

#if defined(USE_HAL_AES_DMA) && (USE_HAL_AES_DMA == 1)
/**
  * @brief AES DMA process for ECB, CBC and CTR algorithms.
  *      - Set the DMA configuration.
  *      - Start the DMA data transfer from the input user buffer to the AES peripheral, at the end of the transfer, a
  *        callback is then generated.
  *      - Start the DMA data transfer from the AES peripheral to the output user buffer, at the end of the transfer a
  *        callback is generated.
  *        The Padding is not supported.
  * @param  haes      Pointer to a @ref hal_aes_handle_t structure
  * @retval HAL_ERROR Error return when the DMA start transfer fails
  * @retval HAL_OK    DMA process is successfully accomplished
  */
static hal_status_t AES_ECB_CBC_CTR_Process_DMA(hal_aes_handle_t *haes)
{
  haes->hdma_in->p_xfer_cplt_cb = AES_ECB_CBC_CTR_DMAInCplt;
  haes->hdma_in->p_xfer_error_cb = AES_DMAError;
  haes->hdma_out->p_xfer_cplt_cb = AES_ECB_CBC_CTR_DMAOutCplt;

  haes->hdma_out->p_xfer_error_cb = AES_DMAError;

  AES_ENABLE(haes);

  if (HAL_DMA_StartPeriphXfer_IT_Opt(haes->hdma_in, (uint32_t)haes->p_in_buff, (uint32_t)&AES_GET_INSTANCE(haes)->DINR,
                                     haes->data_size_byte, HAL_DMA_OPT_IT_NONE) != HAL_OK)
  {
    AES_DISABLE(haes);

#if defined(USE_HAL_AES_GET_LAST_ERRORS) && (USE_HAL_AES_GET_LAST_ERRORS == 1)
    haes->last_error_codes |= HAL_AES_ERROR_DMA;
#endif /* USE_HAL_AES_GET_LAST_ERRORS */

    haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
    haes->p_error_cb(haes);
#else
    HAL_AES_ErrorCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */

    return HAL_ERROR;
  }

  if (HAL_DMA_StartPeriphXfer_IT_Opt(haes->hdma_out, (uint32_t)&AES_GET_INSTANCE(haes)->DOUTR,
                                     (uint32_t)haes->p_out_buff, haes->data_size_byte, HAL_DMA_OPT_IT_NONE) != HAL_OK)
  {
    AES_DISABLE(haes);

#if defined(USE_HAL_AES_GET_LAST_ERRORS) && (USE_HAL_AES_GET_LAST_ERRORS == 1)
    haes->last_error_codes |= HAL_AES_ERROR_DMA;
#endif /* USE_HAL_AES_GET_LAST_ERRORS */

    haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
    haes->p_error_cb(haes);
#else
    HAL_AES_ErrorCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */

    return HAL_ERROR;
  }

  STM32_SET_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_DMAINEN | AES_CR_DMAOUTEN);

  return HAL_OK;
}

/**
  * @brief  DMA AES transfer in the complete callback for ECB, CBC and CTR algorithms.
  * @param  hdma DMA handle
  */
static void AES_ECB_CBC_CTR_DMAInCplt(hal_dma_handle_t *hdma)
{
  hal_aes_handle_t *haes = (hal_aes_handle_t *)(hdma->p_parent);

  STM32_CLEAR_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_DMAINEN);

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
  haes->p_in_cplt_cb(haes);
#else
  HAL_AES_InCpltCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
}

/**
  * @brief  DMA AES transfer out complete callback for ECB, CBC and CTR algorithms.
  * @param  hdma DMA handle
  */
static void AES_ECB_CBC_CTR_DMAOutCplt(hal_dma_handle_t *hdma)
{
  hal_aes_handle_t *haes = (hal_aes_handle_t *)(hdma->p_parent);

  STM32_CLEAR_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_DMAOUTEN);

  HAL_AES_ClearFlagCC(haes);

  AES_DISABLE(haes);

  uint32_t tmp_data_size_sum_byte = haes->data_size_sum_byte;
  haes->data_size_sum_byte = tmp_data_size_sum_byte + haes->data_size_byte;

  haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
  haes->p_out_cplt_cb(haes);
#else
  HAL_AES_OutCpltCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
}
#endif /* USE_HAL_AES_DMA */

#endif /* USE_HAL_AES_ECB_CBC_ALGO or USE_HAL_AES_CTR_ALGO */

#if (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)) \
 || (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))
/**
  * @brief Process the user data through three phases.
  *      - Initial phase: A mandatory phase which consists of:
  *                      - For GCM: Preparing the hash subkey.
  *                      - For CCM: Computing the counter using b0.
  *      - Header phase: This phase is skipped for GCM and CCM when the user provides a null header (b1). It consists of
  *                      - For GCM: Processing the additional authenticated data (AAD), with hash computation only,
  *                                 which is the input of GF2mul function to generate the tag.
  *                      - For CCM: Processing the associated data (A), with tag computation only.
  *      - Payload phase: This phase is skipped for GCM and CCM when the user provided null plaintext. It consists of
  *                       Processing all user data by blocks from the user input buffer to the input data register and
  *                       from the output data register to the output data buffer.
  * @param  haes        Pointer to a @ref hal_aes_handle_t structure
  * @param  timeout_ms  Specify Timeout value in milliseconds
  * @retval HAL_TIMEOUT AES process exceeds user timeout
  * @retval HAL_OK      AES process is successfully accomplished
  */
static hal_status_t AES_GCM_GMAC_CCM_Process(hal_aes_handle_t *haes, uint32_t timeout_ms)
{
  if (haes->data_size_sum_byte  == 0U)
  {
    if (AES_SetInitPhase(haes, timeout_ms) != HAL_OK)
    {
      return HAL_TIMEOUT;
    }

    if (haes->header_size_byte == 0U)
    {
      if (haes->data_size_byte == 0U)
      {
        STM32_MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_CPHASE, AES_PHASE_PAYLOAD);
        AES_ENABLE(haes);
        return HAL_OK;
      }
    }
    else
    {
      if (AES_SetHeaderPhase(haes, timeout_ms) != HAL_OK)
      {
        return HAL_TIMEOUT;
      }
    }
  }

