MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_aes.c
  if ((haes->data_size_byte != 0U) && (haes->p_in_buff != NULL))
  {
    if (AES_SetPayloadPhase(haes, timeout_ms) != HAL_OK)
    {
      return HAL_TIMEOUT;
    }
  }

  return HAL_OK;
}

/**
  * @brief  Initial AES process mandatory phase which consists of:
  *         - For GCM: preparing the hash subkey.
  *         - For CCM: computing the counter using b0.
  * @param  haes        Pointer to a @ref hal_aes_handle_t structure
  * @param  timeout_ms  Specify Timeout value in milliseconds
  * @retval HAL_TIMEOUT AES process exceeds user timeout
  * @retval HAL_OK      AES process is successfully accomplished
  */
static hal_status_t AES_SetInitPhase(hal_aes_handle_t *haes, uint32_t timeout_ms)
{
  STM32_MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_CPHASE, AES_PHASE_INIT);
  AES_ENABLE(haes);

  if (AES_WaitOnCCFlag(haes, timeout_ms) != HAL_OK)
  {
    return HAL_TIMEOUT;
  }

  HAL_AES_ClearFlagCC(haes);

  return HAL_OK;
}

/**
  * @brief  Header AES process phase.
  *       - This phase is skipped when the user provided a null header (b1).
  *       - It consists of processing all header data by blocks from the user input buffer to the input data register.
  *       - The driver pads the missing words of the last block with zeros.
  *       - No read from AES output data register is required.
  * @param  haes        Pointer to a @ref hal_aes_handle_t structure
  * @param  timeout_ms  Specify Timeout value in milliseconds
  * @retval HAL_TIMEOUT AES process exceeds user timeout
  * @retval HAL_OK      AES process is successfully accomplished
  */
static hal_status_t AES_SetHeaderPhase(hal_aes_handle_t *haes, uint32_t timeout_ms)
{
  AES_TypeDef *aes_instance = AES_GET_INSTANCE(haes);
  uint32_t valid_header_block_numbers = haes->header_size_byte >> 4U;
  uint32_t remaining_header_bytes = haes->header_size_byte & 0xFU;
  uint32_t header_block_count;

  STM32_MODIFY_REG(aes_instance->CR, AES_CR_CPHASE, AES_PHASE_HEADER);
  AES_ENABLE(haes);

  /* Write all the valid blocks (multiple of 4 words), no read to be performed for the header */
  for (header_block_count = 0U; header_block_count < valid_header_block_numbers; header_block_count++)
  {
    haes->block_count = header_block_count;
    uint32_t offset_block_word = haes->block_count * AES_BLOCK_WORDS;
    /* Write the input block in the IN FIFO */
    for (uint32_t i = 0U; i < AES_BLOCK_WORDS ; i++)
    {
      aes_instance->DINR  = haes->p_header[offset_block_word + i];
    }

    if (AES_WaitOnCCFlag(haes, timeout_ms) != HAL_OK)
    {
      return HAL_TIMEOUT;
    }
    HAL_AES_ClearFlagCC(haes);
  }

  haes->block_count = header_block_count;

  /* Process the last incomplete block if exist:If some bytes lasts they must be processed in one last block */
  if (remaining_header_bytes != 0U)
  {
    if (AES_PaddingData(haes, haes->p_header, remaining_header_bytes, timeout_ms) != HAL_OK)
    {
      return HAL_TIMEOUT;
    }
  }
  return HAL_OK;
}

/**
  * @brief  Payload AES process phase.
  *       - This phase is skipped when the user provided null plaintext.
  *       - It consists of processing all user data by blocks from the user input buffer to the input data register and
  *         from the output data register to the output data buffer.
  *       - The driver pads the missing words of the last block with zeros.
  * @param  haes        Pointer to a @ref hal_aes_handle_t structure
  * @param  timeout_ms  Specify Timeout value in milliseconds
  * @retval HAL_TIMEOUT AES process exceeds user timeout
  * @retval HAL_OK      AES process is successfully accomplished
  */
static hal_status_t AES_SetPayloadPhase(hal_aes_handle_t *haes, uint32_t timeout_ms)
{
  AES_TypeDef *aes_instance = AES_GET_INSTANCE(haes);
  uint32_t valid_payload_block_numbers = haes->data_size_byte >> 4U;
  uint32_t remaining_payload_bytes = haes->data_size_byte & 0xFU;

  STM32_MODIFY_REG(aes_instance->CR, AES_CR_CPHASE, AES_PHASE_PAYLOAD);
  AES_ENABLE(haes);

  /* Process all the valid blocks (multiple of 4 words) */
  for (uint32_t payload_block_count = 0U; payload_block_count < valid_payload_block_numbers; payload_block_count++)
  {
    haes->block_count = payload_block_count;
    if (AES_ProcessOneblock(haes, timeout_ms) != HAL_OK)
    {
      return HAL_TIMEOUT;
    }
  }
  haes->block_count = valid_payload_block_numbers;

  /* Process the last incomplete block if exist: If some bytes lasts they must be processed in one last block */
  if (remaining_payload_bytes != 0U)
  {
    uint32_t aes_algorithm_mode = STM32_READ_BIT(aes_instance->CR, AES_CR_CHMOD | AES_CR_MODE);
    if ((aes_algorithm_mode == (AES_ALGORITHM_GCM_GMAC | AES_OPERATING_MODE_ENCRYPT))
        || (aes_algorithm_mode == (AES_ALGORITHM_CCM | AES_OPERATING_MODE_DECRYPT)))
    {
      STM32_MODIFY_REG(aes_instance->CR, AES_CR_NPBLB, (16U - remaining_payload_bytes) << 20U);
    }
    if (AES_PaddingData(haes, haes->p_in_buff, remaining_payload_bytes, timeout_ms) != HAL_OK)
    {
      return HAL_TIMEOUT;
    }
  }
  uint32_t tmp_data_size_sum_byte = haes->data_size_sum_byte;
  haes->data_size_sum_byte = tmp_data_size_sum_byte + haes->data_size_byte;
  return HAL_OK;
}

/**
  * @brief  Padding the missing words within the last block with zeros then process a complete padded block.
  * @param  haes            Pointer to a @ref hal_aes_handle_t structure
  * @param  p_tmp_in_buff   Input buffer (Plaintext, ciphertext or header)
  * @param  remaining_bytes The number of bytes within the last block
  * @param  timeout_ms      Specify Timeout value in milliseconds
  * @retval HAL_TIMEOUT     AES process exceeds user timeout
  * @retval HAL_OK          AES process is successfully accomplished
  */
static hal_status_t AES_PaddingData(hal_aes_handle_t *haes, const uint32_t *p_tmp_in_buff, uint32_t remaining_bytes,
                                    uint32_t timeout_ms)
{
  AES_TypeDef *aes_instance = AES_GET_INSTANCE(haes);
  uint32_t last_block_valid_words_numbers;
  uint32_t offset_block_word = haes->block_count * AES_BLOCK_WORDS;
  const uint32_t *current_address;
  uint32_t counter = 0;
  uint32_t aes_output_block[4] = {0};
  uint32_t tmp;
  uint32_t tmp_header_size_byte = haes->header_size_byte;
  const uint32_t mask[16] = {0x0U, 0xFF000000U, 0xFFFF0000U, 0xFFFFFF00U,  /* 32- bit data type */
                             0x0U, 0x0000FF00U, 0x0000FFFFU, 0xFF00FFFFU,  /* 16- bit data type */
                             0x0U, 0x000000FFU, 0x0000FFFFU, 0x00FFFFFFU,  /* 8- bit data type */
                             0x0U, 0x000000FFU, 0x0000FFFFU, 0x00FFFFFFU,  /* 1- bit data type */
                            };

  current_address = (const uint32_t *)(p_tmp_in_buff + offset_block_word);

