MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_aes.c
  if (STM32_READ_BIT(aes_instance->CR, AES_CR_CPHASE) == AES_PHASE_HEADER)
  {
    last_block_valid_words_numbers = remaining_bytes  >> 2U;
    /* Process valid words within the last block */
    for (uint32_t i = 0U; i < last_block_valid_words_numbers ; i++)
    {
      aes_instance->DINR  = *(const uint32_t *)current_address;
      current_address ++;
    }
    /* Enter last bytes, padded with zeros */
    if ((remaining_bytes & 0x3U) != 0U)
    {
      tmp =  *current_address;
      tmp &= mask[(STM32_READ_BIT(aes_instance->CR, AES_CR_DATATYPE) * 2U) + (tmp_header_size_byte  & 0x3U)];
      aes_instance->DINR = tmp;
      last_block_valid_words_numbers++;
    }
  }
  else
  {
    last_block_valid_words_numbers = (remaining_bytes + 3U)  >> 2U;
    /* Process valid words within the last block */
    for (uint32_t i = 0U; i < last_block_valid_words_numbers ; i++)
    {
      aes_instance->DINR  = *(const uint32_t *)current_address;
      current_address ++;
    }
  }

  /* Process the remaining words within the last block as zeros if exist */
  while (counter < (AES_BLOCK_WORDS - last_block_valid_words_numbers))
  {
    aes_instance->DINR = 0x0U;
    counter++;
  }

  if (AES_WaitOnCCFlag(haes, timeout_ms) != HAL_OK)
  {
    return HAL_TIMEOUT;
  }

  HAL_AES_ClearFlagCC(haes);

  if (STM32_READ_BIT(aes_instance->CR, AES_CR_CPHASE) == AES_PHASE_PAYLOAD)
  {
    for (uint32_t i = 0U; i < AES_BLOCK_WORDS ; i++)
    {
      aes_output_block[i] = AES_GET_INSTANCE(haes)->DOUTR;
    }
    uint32_t limit = ((haes->data_size_byte + 3U) >> 2U) - offset_block_word;
    for (uint32_t i = 0U; ((i < limit) && (i < 4U)); i++)
    {
      haes->p_out_buff[offset_block_word] = aes_output_block[i];
      offset_block_word++;
    }
  }

  return HAL_OK;
}

/**
  * @brief Enable interrupts and generate computation complete interrupt via one of two cases:
  *        - Case 1: Accomplish the Init phase for the first encrypt call.
  *        - Case 2: Skip the Init phase in case of processing the message with several encrypt runs and starts the
  *          payload phase by processing calling the AES_StartPayloadPhase_IT() API.
  * @param  haes Pointer to a @ref hal_aes_handle_t structure
  * @retval HAL_ERROR  Error return when the Init phase fails
  * @retval HAL_OK     AES starting IT process is successfully accomplished
  */
static hal_status_t AES_GCM_GMAC_CCM_Start_Process_IT(hal_aes_handle_t *haes)
{
  uint32_t tmp_data_size_byte = haes->data_size_byte;

  /* Enable interrupts and generate computation complete interrupt by setting the Init phase for first encrypt call */
  if (haes->data_size_sum_byte  == 0U)
  {
    if ((haes->header_size_byte == 0U) && ((tmp_data_size_byte == 0U)))
    {
      if (AES_SetInitPhase_NonBlocking(haes) != HAL_OK)
      {
        haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
        haes->p_error_cb(haes);
#else
        HAL_AES_ErrorCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
        return HAL_ERROR;
      }
      STM32_MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_CPHASE, AES_PHASE_PAYLOAD);
      AES_ENABLE(haes);
      haes->global_state = HAL_AES_STATE_IDLE;
    }
    else
    {
      STM32_MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_CPHASE, AES_PHASE_INIT);
      AES_ENABLE(haes);

      HAL_AES_EnableIT(haes, HAL_AES_IT_ALL);
    }
  }
  /* Skip the Init phase in case of processing the message with several encrypt runs, Enable interrupts and generate the
    computation complete interrupt via AES_StartPayloadPhase_IT: process one block */
  else
  {
    if ((tmp_data_size_byte != 0U) && (haes->p_in_buff != NULL))
    {
      AES_StartPayloadPhase_IT(haes);
      HAL_AES_EnableIT(haes, HAL_AES_IT_ALL);
    }
  }

  return HAL_OK;
}

/**
  * @brief  Initial AES process in non blocking mode which consists of:
  *         - For GCM: preparing the hash subkey.
  *         - For CCM: computing the counter using b0.
  * @param  haes       Pointer to a @ref hal_aes_handle_t structure
  * @retval HAL_ERROR  AES Init phase exceeds AES_INIT_PHASE_LATENCY
  * @retval HAL_OK     AES Init phase is successfully accomplished
  */
static hal_status_t AES_SetInitPhase_NonBlocking(hal_aes_handle_t *haes)
{
  STM32_MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_CPHASE, AES_PHASE_INIT);
  AES_ENABLE(haes);

  if (AES_WaitOnCCFlag_NonBlocking(haes, AES_INIT_PHASE_LATENCY) != HAL_OK)
  {
    return HAL_ERROR;
  }

  HAL_AES_ClearFlagCC(haes);

  return HAL_OK;
}

/**
  * @brief Performing the header phase in interrupt mode for GCM, GMAC and CCM algorithms.
  *        Once the Init phase is set by AES_GCM_GMAC_CCM_Start_Process_IT() API, a computation complete interrupt is
  *        generated, then the program enters the IRQHandler, and starts performing the header phase: Each block
  *        writing generates the computation complete interrupt (No block reading during the header phase).
  * @param  haes Pointer to a @ref hal_aes_handle_t structure
  */
static void AES_SetHeaderPhase_IT(hal_aes_handle_t *haes)
{
  AES_TypeDef *aes_instance = AES_GET_INSTANCE(haes);
  uint32_t header_block_numbers = (haes->header_size_byte + 15U) >> 4U;
  uint32_t valid_header_block_numbers = haes->header_size_byte >> 4U;
  uint32_t remaining_header_bytes = haes->header_size_byte & 0xFU;
  uint32_t header_block_count = haes->block_count;

  /* Process all the valid blocks (multiple of 4 words):Write blocks only */
  if (header_block_count < valid_header_block_numbers)
  {
#if defined(USE_HAL_AES_SUSPEND_RESUME) && (USE_HAL_AES_SUSPEND_RESUME == 1)
    /* A suspension is already requested */
    if ((haes->suspend_request == AES_SUSPEND) && (header_block_count > 0U))
    {
      haes->suspend_request = AES_SUSPEND_NONE;
      HAL_AES_ClearFlagCC(haes);
      /* Disable Computation Complete flag and errors interrupts */
      HAL_AES_DisableIT(haes, HAL_AES_IT_ALL);
      haes->global_state = HAL_AES_STATE_SUSPENDED;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
      haes->p_suspend_cb(haes);
#else
      HAL_AES_SuspendCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
    }
    else
#endif /* USE_HAL_AES_SUSPEND_RESUME */
    {
      uint32_t offset_header_block_word = header_block_count << 2U;
      /* Write one AES block (4 words) to the input FIFO to start processing */
      for (uint32_t i = 0U; i < AES_BLOCK_WORDS ; i++)
      {
        aes_instance->DINR  = haes->p_header[offset_header_block_word + i];
      }

      ++header_block_count;
      haes->block_count = header_block_count;
    }
  }
  /* Process the last padded block ( if exist) */
  else
  {
    /* No last block, all header was processed */
    if (header_block_count == header_block_numbers)
    {
      /* When all the header is processed there are two possible cases:
      Case1: Proceed to payload phase: AES_StartPayloadPhase_IT
      Case2: Plaintext null: Disable interrupts and end process */
      if ((haes->data_size_byte != 0U) && (haes->p_in_buff != NULL))
      {
        haes->block_count = 0U;
        HAL_AES_ClearFlagCC(haes);
        STM32_MODIFY_REG(aes_instance->CR, AES_CR_CPHASE, AES_PHASE_PAYLOAD);
        AES_StartPayloadPhase_IT(haes);
      }
      else
      {
        /* Disable Computation Complete flag and errors interrupts */
        HAL_AES_DisableIT(haes, HAL_AES_IT_ALL);
        haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
        haes->p_in_cplt_cb(haes);
#else
        HAL_AES_InCpltCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
      }
    }
    else
    {
      AES_PaddingData_IT(haes, haes->p_header, remaining_header_bytes);
      ++header_block_count;
      haes->block_count = header_block_count;
    }
  }
}

/**
  * @brief  Start the payload phase by writing the first block to generate a computation complete interrupt.
  * @param  haes Pointer to a @ref hal_aes_handle_t structure
  */
static void AES_StartPayloadPhase_IT(hal_aes_handle_t *haes)
{
  AES_TypeDef *aes_instance = AES_GET_INSTANCE(haes);
  uint32_t valid_payload_block_numbers = haes->data_size_byte >> 4U;
  uint32_t remaining_payload_bytes = haes->data_size_byte & 0xFU;

  /* Process the first valid block if exist to generate the computation complete interrupt */
  if ((valid_payload_block_numbers - haes->block_count) != 0U)
  {
    /* Write one AES block (4 words) to the input FIFO to start processing */
    for (uint32_t i = 0U; i < AES_BLOCK_WORDS ; i++)
    {
      aes_instance->DINR = haes->p_in_buff[(haes->block_count * AES_BLOCK_WORDS) + i];
    }
  }
  /* No valid block exist: Pad the only one last block and Process it to generate the computation complete interrupt */
  else
  {
    uint32_t aes_algorithm_mode  = STM32_READ_BIT(aes_instance->CR, AES_CR_CHMOD | AES_CR_MODE);
    if ((aes_algorithm_mode  == (AES_ALGORITHM_GCM_GMAC | AES_OPERATING_MODE_ENCRYPT))
        || (aes_algorithm_mode  == (AES_ALGORITHM_CCM | AES_OPERATING_MODE_DECRYPT)))
    {
      STM32_MODIFY_REG(aes_instance->CR, AES_CR_NPBLB, (16U - remaining_payload_bytes) << 20U);
    }

