MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_aes.c
    AES_PaddingData_IT(haes, haes->p_in_buff, remaining_payload_bytes);

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
    haes->p_in_cplt_cb(haes);
#else
    HAL_AES_InCpltCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
  }
}

/**
  * @brief Performing the payload phase in interrupt mode for GCM, GMAC and CCM algorithms.
  *        Once a computation complete interrupt is generated by the AES_StartPayloadPhase_IT() API, the program enters
  *        the IRQHandler, reads the encrypted block from the output data register and performs the write of a new block
  *, then a second interrupt is generated.
  * @param  haes Pointer to a @ref hal_aes_handle_t structure
  */
static void AES_SetPayloadPhase_IT(hal_aes_handle_t *haes)
{
  AES_TypeDef *aes_instance = AES_GET_INSTANCE(haes);
  uint32_t data_block_numbers = (haes->data_size_byte + 15U) >> 4U;
  uint32_t valid_block_numbers = haes->data_size_byte >> 4U;
  uint32_t remaining_payload_bytes = haes->data_size_byte & 0xFU;
  uint32_t offset_block_word;
  uint32_t block_count = haes->block_count;
  uint32_t aes_output_block[4] = {0};
  uint32_t tmp_data_size_sum_byte;

  /* Read from DOUTR after each computation complete interrupt
     First start to read the first block processed via AES_StartPayloadPhase_IT */
  if (block_count < data_block_numbers)
  {
    offset_block_word = block_count * AES_BLOCK_WORDS;
    for (uint32_t i = 0U; i < AES_BLOCK_WORDS ; i++)
    {
      aes_output_block[i] = aes_instance->DOUTR;
    }
    uint32_t limit = ((haes->data_size_byte + 3U) >> 2U) - offset_block_word;
    for (uint32_t i = 0U; ((i < limit) && (i < 4U)); i++)
    {
      haes->p_out_buff[offset_block_word] = aes_output_block[i];
      offset_block_word++;
    }
  }

  block_count++;
  haes->block_count = block_count;
  offset_block_word = block_count * AES_BLOCK_WORDS;

#if defined(USE_HAL_AES_SUSPEND_RESUME) && (USE_HAL_AES_SUSPEND_RESUME == 1)
  /* A suspension is already requested */
  if (haes->suspend_request == AES_SUSPEND)
  {
    if (block_count <= valid_block_numbers)
    {
      HAL_AES_ClearFlagCC(haes);

      haes->suspend_request = AES_SUSPEND_NONE;

      /* Disable Computation Complete flag and errors interrupts */
      HAL_AES_DisableIT(haes, HAL_AES_IT_ALL);

      haes->global_state = HAL_AES_STATE_SUSPENDED;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
      haes->p_suspend_cb(haes);
#else
      HAL_AES_SuspendCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
    }
  }
  else
#endif /* USE_HAL_AES_SUSPEND_RESUME */
  {
    /* Process valid blocks: write to DINR generates a computation complete interrupt */
    if (block_count < valid_block_numbers)
    {
      /* Write one AES block (4 words) to the input FIFO to start processing */
      for (uint32_t i = 0U; i < AES_BLOCK_WORDS ; i++)
      {
        aes_instance->DINR  = haes->p_in_buff[offset_block_word + i];
      }
    }
    /* If all valid blocks are processed: Two possible cases
     Case 1: Pad data and process the last padded block if exist
     Case 2: Invalid block does not exist and all the data is processed:Disable interrupts and end process */
    else if (block_count == valid_block_numbers)
    {
      /* Case1: Pad data and process the last padded block if exist */
      if (remaining_payload_bytes != 0U)
      {
        uint32_t aes_algorithm_mode = STM32_READ_BIT(aes_instance->CR, AES_CR_CHMOD | AES_CR_MODE);
        if ((aes_algorithm_mode == (AES_ALGORITHM_GCM_GMAC | AES_OPERATING_MODE_ENCRYPT))
            || (aes_algorithm_mode == (AES_ALGORITHM_CCM | AES_OPERATING_MODE_DECRYPT)))
        {
          STM32_MODIFY_REG(aes_instance->CR, AES_CR_NPBLB, (16U - remaining_payload_bytes) << 20U);
        }

        AES_PaddingData_IT(haes, haes->p_in_buff, remaining_payload_bytes);
      }
      /* Case 2: Invalid block does not exist and all the data is processed:Disable interrupts and end process */
      else
      {
        tmp_data_size_sum_byte = haes->data_size_sum_byte;
        haes->data_size_sum_byte = tmp_data_size_sum_byte + haes->data_size_byte;

        /* Disable Computation Complete flag and errors interrupts */
        HAL_AES_DisableIT(haes, HAL_AES_IT_ALL);

        haes->global_state = HAL_AES_STATE_IDLE;
      }

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
      haes->p_in_cplt_cb(haes);
#else
      HAL_AES_InCpltCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
    }
    /* If all data is processed: The last padded block was just processed in the previous interrupt */
    else
    {
      tmp_data_size_sum_byte = haes->data_size_sum_byte;
      haes->data_size_sum_byte = tmp_data_size_sum_byte + haes->data_size_byte;

      /* Disable Computation Complete flag and errors interrupts */
      HAL_AES_DisableIT(haes, HAL_AES_IT_ALL);

      haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
      haes->p_out_cplt_cb(haes);
#else
      HAL_AES_OutCpltCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
    }
  }
}

/**
  * @brief  Padding the missing words within the last block with zeros then process a complete padded block in IT mode.
  * @param  haes            Pointer to a @ref hal_aes_handle_t structure
  * @param  p_tmp_in_buff   Input buffer (Plaintext, ciphertext or header)
  * @param  remaining_bytes The number of bytes within the last block
  */
static void AES_PaddingData_IT(hal_aes_handle_t *haes, const uint32_t *p_tmp_in_buff, uint32_t remaining_bytes)
{
  AES_TypeDef *aes_instance = AES_GET_INSTANCE(haes);
  uint32_t last_block_valid_words_numbers;
  uint32_t offset_block_word = haes->block_count * AES_BLOCK_WORDS;
  const uint32_t *current_address;
  uint32_t tmp;
  uint32_t tmp_header_size_byte = haes->header_size_byte;
  const uint32_t mask[16] = {0x0U, 0xFF000000U, 0xFFFF0000U, 0xFFFFFF00U,  /* 32- bit data type */
                             0x0U, 0x0000FF00U, 0x0000FFFFU, 0xFF00FFFFU,  /* 16- bit data type */
                             0x0U, 0x000000FFU, 0x0000FFFFU, 0x00FFFFFFU,  /* 8- bit data type */
                             0x0U, 0x000000FFU, 0x0000FFFFU, 0x00FFFFFFU,  /* 1- bit data type */
                            };

  current_address = (const uint32_t *)(p_tmp_in_buff + offset_block_word);

