MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_aes.c
  if (STM32_READ_BIT(aes_instance->CR, AES_CR_CPHASE) == AES_PHASE_HEADER)
  {
    last_block_valid_words_numbers = remaining_bytes >> 2U;
    /* Process valid words within the last block */
    for (uint32_t i = 0U; i < last_block_valid_words_numbers ; i++)
    {
      aes_instance->DINR  = *(const uint32_t *)current_address;
      current_address ++;
    }
    /* Enter last bytes, padded with zeros */
    if ((remaining_bytes & 0x3U) != 0U)
    {
      tmp =  *current_address;
      tmp &= mask[(STM32_READ_BIT(aes_instance->CR, AES_CR_DATATYPE) * 2U) + (tmp_header_size_byte & 0x3U)];
      aes_instance->DINR = tmp;
      last_block_valid_words_numbers++;
    }
  }
  else
  {
    last_block_valid_words_numbers = (remaining_bytes + 3U) >> 2U;
    /* Process valid words within the last block */
    for (uint32_t i = 0U; i < last_block_valid_words_numbers ; i++)
    {
      aes_instance->DINR  = *(const uint32_t *)current_address;
      current_address ++;
    }
  }

  /* Process the remaining words within the last block as zeros if exist */
  for (uint32_t i = last_block_valid_words_numbers; i < AES_BLOCK_WORDS; i++)
  {
    aes_instance->DINR = 0x0U;
  }
}

#if defined(USE_HAL_AES_DMA) && (USE_HAL_AES_DMA == 1)
/**
  * @brief  AES DMA process for GCM, GMAC and CCM algorithm through three phases:
  *       - Initial phase: A mandatory phase Handled only by AES (No DMA transfer) and consists of:
  *                        - For GCM: preparing hash subkey.
  *                        - For CCM: computing the counter using b0.
  *       - Header phase: This phase is skipped for GCM and CCM when the user provides a null header (b1).
  *                       It consists of:
  *                       - processing all valid header blocks(four words) from the provided user header to the AES
  *                        peripheral (The padding is handled without DMA).
  *       - Payload phase: This phase is skipped for GCM and CCM when the user provides a null plaintext.It consists of:
  *                       - Processing all valid plaintext blocks (The padding is handled without DMA).
  * @param  haes       Pointer to a @ref hal_aes_handle_t structure
  * @retval HAL_ERROR  Error return when the DMA start transfer fails or when the AES process exceeds INIT PHASE latency
  * @retval HAL_OK     DMA process is successfully accomplished
  */
static hal_status_t AES_GCM_GMAC_CCM_Process_DMA(hal_aes_handle_t *haes)
{
  hal_status_t status = HAL_ERROR;
  uint32_t tmp_data_size_byte = haes->data_size_byte;

  if (haes->data_size_sum_byte  == 0U)
  {
    if (AES_SetInitPhase_NonBlocking(haes) != HAL_OK)
    {
      haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
      haes->p_error_cb(haes);
#else
      HAL_AES_ErrorCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
      return HAL_ERROR;
    }

    if ((haes->header_size_byte == 0U) && ((tmp_data_size_byte == 0U)))
    {
      STM32_MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_CPHASE, AES_PHASE_PAYLOAD);
      AES_ENABLE(haes);
      haes->global_state = HAL_AES_STATE_IDLE;
      return HAL_OK;
    }
    else if (haes->header_size_byte != 0U)
    {
      status = AES_SetHeaderPhase_DMA(haes);
    }
    else
    {
      status = AES_SetPayloadPhase_DMA(haes);
    }
  }
  else if ((tmp_data_size_byte != 0U) && (haes->p_in_buff != NULL))
  {
    status = AES_SetPayloadPhase_DMA(haes);
  }
  else
  {
    /* Nothing to do */
  }

  return status;
}

/**
  * @brief AES DMA Payload phase process.
  *      - This phase is skipped when the user provided null plaintext.
  *      - There are two possible cases to process data:
  *       - Case1:When there is valid data blocks, the AES_SetPayloadPhase_DMA() acts as follows:
  *         - Set the DMA configuration.
  *         - Start the DMA transfer of all valid data blocks from the input user buffer to the AES peripheral, at the
  *          end of the transfer a callback is generated.
  *         - Start the DMA data transfer from the AES peripheral to the output user buffer, at the end of the transfer
  *          a callback is generated and handle the invalid last block if exists(Pad missing words with zeros  and
  *          transfer the last block without DMA from the input buffer to the AES peripheral and read out its equivalent
  *          encrypted block.
  *       - Case2:When there is any valid data block, (only unique incomplete block) the AES_SetPayloadPhase_DMA() acts
  *         as follows:
  *         - Pad missing words with zeros and transfer data without DMA from the input buffer to the AES peripheral
  *           and read out its equivalent encrypted block.
  * @param  haes        Pointer to a @ref hal_aes_handle_t structure
  * @note   The minimum data amount transferred with DMA is equal to one block (four complete words), as the DMA
            transfer does not support the padding(the driver handles the padding with a direct transfer of incomplete
            data without using the DMA)
  * @retval HAL_ERROR   Error return when the DMA start transfer fails or when the payload phase exceeds payload latency
  * @retval HAL_OK      DMA process is successfully accomplished
  */
static hal_status_t AES_SetPayloadPhase_DMA(hal_aes_handle_t *haes)
{
  AES_TypeDef *aes_instance = AES_GET_INSTANCE(haes);
  uint32_t valid_payload_block_numbers = haes->data_size_byte >> 4U;
  uint32_t remaining_payload_bytes = haes->data_size_byte & 0xFU;

  STM32_MODIFY_REG(aes_instance->CR, AES_CR_CPHASE, AES_PHASE_PAYLOAD);
  AES_ENABLE(haes);

  /* If the payload size is at least equal to 16 bytes, feed the payload through DMA.
     If the size_in_bytes is not a multiple of blocks (is not a multiple of four 32- bit words ),
     last bytes feeding and padding is done in AES_DMAInCplt() */
  if (valid_payload_block_numbers > 0U)
  {
    /* Set the AES DMA In transfer complete callback */
    haes->hdma_in->p_xfer_cplt_cb = AES_GCM_GMAC_CCM_DMAInCplt;
    /* Set the DMA In error callback */
    haes->hdma_in->p_xfer_error_cb = AES_DMAError;

    /* Set the AES DMA Out transfer complete callback */
    haes->hdma_out->p_xfer_cplt_cb = AES_GCM_GMAC_CCM_DMAOutCplt;
    /* Set the DMA Out error callback */
    haes->hdma_out->p_xfer_error_cb = AES_DMAError;

    if (HAL_DMA_StartPeriphXfer_IT_Opt(haes->hdma_in, (uint32_t)haes->p_in_buff,
                                       (uint32_t)&aes_instance->DINR,
                                       valid_payload_block_numbers << 4U, HAL_DMA_OPT_IT_NONE) != HAL_OK)
    {
      AES_DISABLE(haes);

#if defined(USE_HAL_AES_GET_LAST_ERRORS) && (USE_HAL_AES_GET_LAST_ERRORS == 1)
      haes->last_error_codes |= HAL_AES_ERROR_DMA;
#endif /* USE_HAL_AES_GET_LAST_ERRORS */

      haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
      haes->p_error_cb(haes);
#else
      HAL_AES_ErrorCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */

      return HAL_ERROR;
    }

    if (HAL_DMA_StartPeriphXfer_IT_Opt(haes->hdma_out, (uint32_t)&aes_instance->DOUTR,
                                       (uint32_t)haes->p_out_buff, valid_payload_block_numbers << 4U,
                                       HAL_DMA_OPT_IT_NONE) != HAL_OK)
    {
      AES_DISABLE(haes);

#if defined(USE_HAL_AES_GET_LAST_ERRORS) && (USE_HAL_AES_GET_LAST_ERRORS == 1)
      haes->last_error_codes |= HAL_AES_ERROR_DMA;
#endif /* USE_HAL_AES_GET_LAST_ERRORS */

      haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
      haes->p_error_cb(haes);
#else
      HAL_AES_ErrorCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */

      return HAL_ERROR;
    }

