MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_aes.c
    /* Enable the DMA transfer by setting the DMAEN bit */
    STM32_SET_BIT(aes_instance->CR, AES_CR_DMAINEN | AES_CR_DMAOUTEN);
  }
  else
  {
    uint32_t aes_algorithm_mode = STM32_READ_BIT(aes_instance->CR, AES_CR_CHMOD | AES_CR_MODE);
    if ((aes_algorithm_mode == (AES_ALGORITHM_GCM_GMAC | AES_OPERATING_MODE_ENCRYPT))
        || (aes_algorithm_mode == (AES_ALGORITHM_CCM | AES_OPERATING_MODE_DECRYPT)))
    {
      STM32_MODIFY_REG(aes_instance->CR, AES_CR_NPBLB, (16U - remaining_payload_bytes) << 20U);
    }
    if (AES_PaddingData_DMA(haes, haes->p_in_buff, remaining_payload_bytes, AES_PAYLOAD_PHASE_LATENCY) != HAL_OK)
    {
      haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
      haes->p_error_cb(haes);
#else
      HAL_AES_ErrorCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
      return HAL_ERROR;
    }

    uint32_t tmp_data_size_sum_byte = haes->data_size_sum_byte;
    haes->data_size_sum_byte = tmp_data_size_sum_byte + haes->data_size_byte;
    haes->global_state = HAL_AES_STATE_IDLE;
  }

  return HAL_OK;
}

/**
  * @brief  AES DMA Header phase process.
  *       - This phase is skipped when the user provided a null header.
  *       - Two possible cases to process data:
  *        - Case1: When there is valid data blocks, the AES_SetHeaderPhase_DMA() acts as follows:
  *          - Set the DMA configuration.
  *          - Start the DMA transfer of all valid data blocks from the input user header to the AES peripheral, at the
  *           end of the transfer a callback is generated and accomplish the following operations:
  *          - Handles the invalid last block if exist(Pad missing words with zeros  and transfer last block without
  *            DMA from input header to AES peripheral.
  *          - Initiate the payload phase if plaintext is not null.
  *        - Case2: When there is any valid data block, (only unique incomplete block) the AES_SetHeaderPhase_DMA() acts
  *          as follows:
  *          - Pad missing words with zeros  and transfer data without DMA from input header to AES peripheral.
  *          - Initiate the payload phase if plaintext is not null.
  * @param  haes        Pointer to a @ref hal_aes_handle_t structure
  * @note   The minimum data amount transferred with DMA is equal to one block (four complete words), as the DMA
  *         transfer does not support the padding(the driver handles the padding with a direct transfer of incomplete
  *         data without using the DMA)
  * @retval HAL_ERROR   Error return when the DMA start transfer fails or when the header phase exceeds header latency
  * @retval HAL_OK      DMA process is successfully  accomplished
  */
static hal_status_t AES_SetHeaderPhase_DMA(hal_aes_handle_t *haes)
{
  AES_TypeDef *aes_instance = AES_GET_INSTANCE(haes);
  uint32_t valid_header_block_numbers = haes->header_size_byte >> 4U;
  uint32_t remaining_header_bytes = haes->header_size_byte & 0xFU;

  haes->hdma_in->p_xfer_cplt_cb = AES_GCM_GMAC_CCM_DMAInCplt;
  haes->hdma_in->p_xfer_error_cb = AES_DMAError;

  STM32_MODIFY_REG(aes_instance->CR, AES_CR_CPHASE, AES_PHASE_HEADER);
  AES_ENABLE(haes);

  /* If the header size is at least equal to 16 bytes, feed the header via DMA. else if it is not a multiple of block
     , the last bytes feeding and padding is done in AES_DMAInCplt() */
  if (valid_header_block_numbers > 0U)
  {

    if (HAL_DMA_StartPeriphXfer_IT_Opt(haes->hdma_in, (uint32_t)haes->p_header, (uint32_t)&aes_instance->DINR,
                                       valid_header_block_numbers << 4U, HAL_DMA_OPT_IT_NONE) == HAL_OK)
    {
      STM32_SET_BIT(aes_instance->CR, AES_CR_DMAINEN);
    }
    else
    {
      AES_DISABLE(haes);

#if defined(USE_HAL_AES_GET_LAST_ERRORS) && (USE_HAL_AES_GET_LAST_ERRORS == 1)
      haes->last_error_codes |= HAL_AES_ERROR_DMA;
#endif /* USE_HAL_AES_GET_LAST_ERRORS */

      haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
      haes->p_error_cb(haes);
#else
      HAL_AES_ErrorCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */

      return HAL_ERROR;
    }
  }
  else
  {
    if (AES_PaddingData_DMA(haes, haes->p_header, remaining_header_bytes, AES_HEADER_PHASE_LATENCY) != HAL_OK)
    {
      haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
      haes->p_error_cb(haes);
#else
      HAL_AES_ErrorCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
      return HAL_ERROR;
    }

    if ((haes->data_size_byte != 0U) && (haes->p_in_buff != NULL))
    {
      haes->block_count = 0U;
      if (AES_SetPayloadPhase_DMA(haes) != HAL_OK)
      {
        return HAL_ERROR;
      }
    }
    else
    {
      HAL_AES_ClearFlagCC(haes);
      haes->global_state = HAL_AES_STATE_IDLE;
    }
  }
  return HAL_OK;
}

/**
  * @brief  Padding the missing words within the last block with zeros during a DMA transfer.
  * @param  haes                Pointer to a @ref hal_aes_handle_t structure
  * @param  p_tmp_in_buff       Input buffer (Plaintext, ciphertext or header)
  * @param  remaining_bytes     The number of bytes within the last block
  * @param  latency_clock_cycle Specify Latency value in clock cycles
  * @retval HAL_ERROR           Error return when the DMA padding exceeds latency
  * @retval HAL_OK              DMA padding is successfully  accomplished
  */
static hal_status_t AES_PaddingData_DMA(hal_aes_handle_t *haes, const uint32_t *p_tmp_in_buff, uint32_t remaining_bytes,
                                        uint32_t latency_clock_cycle)
{
  AES_TypeDef *aes_instance = AES_GET_INSTANCE(haes);
  uint32_t last_block_valid_words_numbers;
  uint32_t offset_block_word = haes->block_count * AES_BLOCK_WORDS;
  const uint32_t *current_address;
  uint32_t counter = 0;
  uint32_t aes_output_block[4] = {0};
  uint32_t tmp;
  uint32_t tmp_header_size_byte = haes->header_size_byte;
  const uint32_t mask[16] = {0x0U, 0xFF000000U, 0xFFFF0000U, 0xFFFFFF00U,  /* 32- bit data type */
                             0x0U, 0x0000FF00U, 0x0000FFFFU, 0xFF00FFFFU,  /* 16- bit data type */
                             0x0U, 0x000000FFU, 0x0000FFFFU, 0x00FFFFFFU,  /* 8- bit data type */
                             0x0U, 0x000000FFU, 0x0000FFFFU, 0x00FFFFFFU,  /* 1- bit data type */
                            };

  current_address = (const uint32_t *)(p_tmp_in_buff + offset_block_word);

