MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_aes.c
  if (STM32_READ_BIT(aes_instance->CR, AES_CR_CPHASE) == AES_PHASE_HEADER)
  {
    last_block_valid_words_numbers = remaining_bytes >> 2U;
    /* Process valid words within the last block */
    for (uint32_t i = 0U; i < last_block_valid_words_numbers ; i++)
    {
      aes_instance->DINR  = *(const uint32_t *)current_address;
      current_address ++;
    }
    /* Enter last bytes, padded with zeros */
    if ((remaining_bytes & 0x3U) != 0U)
    {
      tmp =  *current_address;
      tmp &= mask[(STM32_READ_BIT(aes_instance->CR, AES_CR_DATATYPE) * 2U) + (tmp_header_size_byte & 0x3U)];
      aes_instance->DINR = tmp;
      last_block_valid_words_numbers++;
    }
  }
  else
  {
    last_block_valid_words_numbers = (remaining_bytes + 3U) >> 2U;
    /* Process valid words within the last block */
    for (uint32_t i = 0U; i < last_block_valid_words_numbers ; i++)
    {
      aes_instance->DINR  = *(const uint32_t *)current_address;
      current_address ++;
    }
  }

  /* Process the remaining words within the last block as zeros if exist */
  while (counter < (AES_BLOCK_WORDS - last_block_valid_words_numbers))
  {
    aes_instance->DINR = 0x0U;
    counter++;
  }

  /* Wait for Computation Complete Flag (CCF) to raise then clear it */
  if (AES_WaitOnCCFlag_NonBlocking(haes, latency_clock_cycle) != HAL_OK)
  {
    return HAL_ERROR;
  }

  HAL_AES_ClearFlagCC(haes);

  if (STM32_READ_BIT(aes_instance->CR, AES_CR_CPHASE) == AES_PHASE_PAYLOAD)
  {
    for (uint32_t i = 0U; i < AES_BLOCK_WORDS ; i++)
    {
      aes_output_block[i] = aes_instance->DOUTR;
    }
    uint32_t limit = ((haes->data_size_byte + 3U) >> 2U) - offset_block_word;
    for (uint32_t i = 0U; ((i < limit) && (i < 4U)); i++)
    {
      haes->p_out_buff[offset_block_word] = aes_output_block[i];
      offset_block_word++;
    }
  }

  return HAL_OK;
}

/**
  * @brief  DMA AES transfer in complete callback for GCM, GMAC and CCM algorithms.
  * @param  hdma DMA handle
  */
static void AES_GCM_GMAC_CCM_DMAInCplt(hal_dma_handle_t *hdma)
{
  hal_aes_handle_t *haes = (hal_aes_handle_t *)(hdma->p_parent);

  uint32_t valid_header_block_numbers = haes->header_size_byte >> 4U;
  uint32_t remaining_header_bytes = haes->header_size_byte & 0xFU;

  STM32_CLEAR_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_DMAINEN);

  /* A DMA transfer complete callback generated from HEADER phase */
  if (STM32_READ_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_CPHASE) == AES_PHASE_HEADER)
  {
    /* Wait for Computation Complete Flag (CCF) to raise then clear it */
    if (AES_WaitOnCCFlag_NonBlocking(haes, AES_HEADER_PHASE_LATENCY) != HAL_OK)
    {

      haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
      haes->p_error_cb(haes);
#else
      HAL_AES_ErrorCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
      return;
    }

    HAL_AES_ClearFlagCC(haes);

    /* Pad last block if exist */
    if (remaining_header_bytes != 0U)
    {
      haes->block_count = valid_header_block_numbers;
      if (AES_PaddingData_DMA(haes, haes->p_header, remaining_header_bytes, AES_HEADER_PHASE_LATENCY) != HAL_OK)
      {
        haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
        haes->p_error_cb(haes);
#else
        HAL_AES_ErrorCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
        return;
      }
    }

    if ((haes->data_size_byte != 0U) && (haes->p_in_buff != NULL))
    {
      haes->block_count = 0U;
      (void) AES_SetPayloadPhase_DMA(haes);
    }
    else
    {
      HAL_AES_ClearFlagCC(haes);
      haes->global_state = HAL_AES_STATE_IDLE;
    }
  }
  else /* Payload input complete */
  {
#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
    haes->p_in_cplt_cb(haes);
#else
    HAL_AES_InCpltCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
  }
}

/**
  * @brief  DMA AES transfer out complete callback for GCM, GMAC and CCM algorithms.
  * @param  hdma DMA handle
  */
static void AES_GCM_GMAC_CCM_DMAOutCplt(hal_dma_handle_t *hdma)
{
  hal_aes_handle_t *haes = (hal_aes_handle_t *)(hdma->p_parent);

  uint32_t valid_payload_block_numbers = haes->data_size_byte >> 4U;
  uint32_t remaining_payload_bytes = haes->data_size_byte & 0xFU;

  STM32_CLEAR_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_DMAOUTEN);

  /* Check if last block exists after DMA transfer complete callback generated from PAYLOAD phase */
  if (remaining_payload_bytes != 0U)
  {
    HAL_AES_ClearFlagCC(haes);
    uint32_t aes_algorithm_mode = STM32_READ_BIT(AES_GET_INSTANCE(haes)->CR, AES_CR_CHMOD | AES_CR_MODE);
    if ((aes_algorithm_mode == (AES_ALGORITHM_GCM_GMAC | AES_OPERATING_MODE_ENCRYPT))
        || (aes_algorithm_mode == (AES_ALGORITHM_CCM | AES_OPERATING_MODE_DECRYPT)))
    {
      STM32_MODIFY_REG(AES_GET_INSTANCE(haes)->CR, AES_CR_NPBLB, (16U - remaining_payload_bytes) << 20U);
    }

    haes->block_count = valid_payload_block_numbers;

    if (AES_PaddingData_DMA(haes, haes->p_in_buff, remaining_payload_bytes, AES_PAYLOAD_PHASE_LATENCY) != HAL_OK)
    {
      haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
      haes->p_error_cb(haes);
#else
      HAL_AES_ErrorCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */
      return;
    }
  }

  HAL_AES_ClearFlagCC(haes);

  uint32_t tmp_data_size_sum_byte = haes->data_size_sum_byte;
  haes->data_size_sum_byte = tmp_data_size_sum_byte + haes->data_size_byte;

  haes->global_state = HAL_AES_STATE_IDLE;

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
  haes->p_out_cplt_cb(haes);
#else
  HAL_AES_OutCpltCallback(haes);
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */

}
#endif /* USE_HAL_AES_DMA */
#endif /* USE_HAL_AES_GCM_GMAC_ALGO or USE_HAL_AES_CCM_ALGO */

#if defined (USE_HAL_AES_RNG_RECOVERY) && (USE_HAL_AES_RNG_RECOVERY == 1U)
#if defined(RNG_HTSR0_RPERRX) || defined(RNG_HTSR1_ADERRX)
/**
  * @brief  Attempts a robust recovery of the RNG after a seed error.
  *         Implements a sequence of health checks, oscillator re-masking
  *         and conditional resets to restore a valid RNG operating state.
  * @retval HAL_ERROR RNG could not be recovered within the configured timeouts.
  * @retval HAL_OK    RNG successfully recovered and no seed error is pending.
  */
hal_status_t AES_RNG_ResilientRecoverSeedError(void)
{
  uint32_t timeout;
  uint32_t htsr_temp = 0U;
  uint32_t htsr_previous_temp = 0U;
  uint32_t htsr_count = 0U;
  uint32_t nsmr_temp = 0U;
  uint32_t tickstart1 = 0U;
  uint32_t tickstart2 = 0U;
  uint32_t tickstart3 = 0U;
  uint32_t oscillators_count = 0U;
  uint32_t config_b_fewer_than_6_osc_count = 0U;
  uint8_t count = 0U;

  /* timeout here is an emperic value */
  timeout = (1UL + ((1UL << (STM32_READ_BIT(RNG->CR, RNG_CR_CLKDIV) >> 16UL)) * AES_RNG_TIMEOUT_VALUE / 8UL));
  LL_RNG_Enable(RNG);

  tickstart1 = HAL_GetTick();

  /* Check if seed error current status indicates no error and auto-reset succeeded */
  if (LL_RNG_IsActiveFlag_SECS(RNG) == 0U)
  {
    /* Clear SEIS flag when automatic reset is activated */
    LL_RNG_ClearFlag_SEIS(RNG);
  }

  else  /* Sequence to fully recover from a seed error*/
  {
    if (LL_RNG_IsConfigLocked(RNG) == 0U)
    {
      do
      {
        if (LL_RNG_IsActiveFlag_SECS(RNG) == 0U)
        {
          break;
        }
        /* Read oscillator status registers combined */
        htsr_temp = LL_RNG_GetHealthTestStatus(RNG, 0U);
        htsr_temp |= LL_RNG_GetHealthTestStatus(RNG, 1U);
        if (htsr_temp > 0U)
        {
          /* If any oscillator status bits overlap with previous status, increment counter */
          if ((htsr_temp & htsr_previous_temp) != 0U)
          {
            htsr_count++;
          }

